import pomelo from "../../../../../imgs/tabaks/420/40gr_darkLine/420_dark_40gr_pomelo.webp";
import tropical_splash from "../../../../../imgs/tabaks/420/40gr_darkLine/420_darkLine_40gr_tropical_splash.webp";

import type { ContentBlock } from "../../../../../types/data";

export const tabacco420Description40gr: ContentBlock[] = [
  {
    header: "Тютюн для кальяну Чотири Двадцять фасуванням 40 грам",
    description1:
      "Тютюн для кальяну 4:20 в упаковці вагою 40 грам - це продукт для справжніх цінителів кальянного мистецтва. У його створенні використовувалися тільки найкращі компоненти, підібрані з особливою ретельністю і увагою до якості.",
    description2:
      "Цей тютюн містить унікальні сорти тютюнового аркуша, які були ретельно відібрані і збалансовані для створення неповторного смаку і аромату.",
    description3:
      "Унікальність тютюну полягає в тому, що кожна його складова піддається суворому контролю якості. Це свого роду гарантія того, що купуючи цей продукт, ви отримуєте безсумнівну якість. Тютюн 4:20 в упаковці 40 грам - відмінне рішення для тривалої насолоди. Тепер вам не потрібно постійно поповнювати запаси. Це не тільки зручно, а й практично для тих, хто любить насолодитися вейпінгом у колі близьких друзів.",
    conclusion1:
      "Купуючи тютюн, ви точно можете розраховувати на інтенсивний смак і густу хмару диму. Серед широкого асортименту можна знайти як легкі фруктові відтінки, так і насичені тютюнові ноти.",
    conclusion2:
      "Характеристики тютюну 4:20 (40 гр) включають у себе середню міцність, широкий вибір смаків, зручну упаковку, високу жаростійкість і доступну вартість.",
    imgUrl: pomelo,
  },
  {
    header: "Легкий",
    description1:
      "Легкий тютюн став ідеальним рішенням для тих, хто любить кальянні сесії з неймовірно м'яким смаком. Також відмінно підійде для курців-початківців, оскільки він досить м'який, але водночас димний, що дасть змогу повністю відчути весь спектр відчуттів від куріння.",
  },
  {
    header: "Більш міцний",
    description1:
      "Для любителів насичених і сильних смакових відчуттів, виробник пропонує більш міцний тютюн. Він підходить для справжніх цінителів куріння.",
    description2: "З таким тютюном кожен охочий може з головою зануритися в глибокі та інтенсивні відтінки.",
  },
  {
    header: "Чайна суміш",
    description1:
      "Чайна суміш є ідеальним поєднанням смаків та ароматів. За допомогою високоякісних сортів чайного листа створюється запаморочлива суміш для кальяну. У неї насичений аромат і завдяки тому, що листя більш щільне, ніж тютюнове, смаком можна насолоджуватися набагато довше. На сьогоднішній день виробник пропонує величезний вибір ароматів, які можна розділити на такі категорії: фрукти, ягоди, десерти, коктейлі.",
  },
  {
    header: "Чому варто купити тютюн 4:20 в упаковці 40 грам?",
    description1:
      "Вибираючи тютюн для кальяну, варто спиратися не тільки на свої смакові переваги, а й на досвід. Тютюн 4:20 40 грам користується великим попитом завдяки зручному фасуванню і різноманітності смаків. З ним можна в будь-який час насолодитися вишуканим ароматом.",
    description2:
      "Висока якість і відповідність усім сучасним стандартам точно не залишать вас байдужими. Придбати упаковку 40 грам тютюну 4:20 можна в інтернет-магазині 'VipKalyan' за дуже вигідною доставкою і з оперативною доставкою. Вибравши тютюн 4:20, ви можете бути впевнені в інтенсивному смаку, густій хмарі диму і приємному курильному досвіді, який залишить вас задоволеним і задоволеним. Також на сайті представлений широкий вибір кальянів від відомих виробників. Продукція має високу якість і відповідає всім стандартам.",
    imgUrl: tropical_splash,
  },
];
