import Acardion from "../../components/Acardion";
import Delivery from "../../components/Delivery";
import Filters from "../../components/Filters";
import GoodsCategories from "../CategoryPage/ProductCategories";
import GoodsList from "../CategoryPage/ProductList";

import vape from "../../imgs/aboutGoods/vape.jpg";
import electronnaSygareta from "../../imgs/aboutGoods/electronnie-sigarety.jpg";

const ElectronCigarettePage = () => {
  return (
    <>
      <h2 className="text-center text-3xl font-medium mt-10 mb-10">Електронні сигарети</h2>
      <div className="grid grid-cols-[250px_1fr] gap-x-7">
        <div>
          <Filters />
        </div>
        <div>
          <GoodsCategories />
          <div className="grid grid-cols-4 mt-5">{/* <GoodsList /> */}</div>
        </div>
      </div>

      <div className="text-center mt-5">{/* <PaginationContainer /> */}</div>

      <Delivery />

      <Acardion
        title="Яку краще купити електронну сигарету для початківців ?"
        description="Якщо Ви вирішили перейти зі звичайних сигарет на електронні, зверніть увагу на рідини із сольовим нікотином. Вони максимально наближені за смаком та відчуттями до звичайних сигарет. Наші консультанти допоможуть зробити вибір."
      />
      <Acardion
        title="На якому випаровувачі більше смаку ?"
        description="У нашому магазині представлені моделі з випаровувачем у вигляді спіралі та сітки. Сітка забезпечує більш насичений смак пару. Але при цьому за рахунок опору підвищує витрату акумулятора та рідини."
      />
      <Acardion
        title="Що буде, якщо парити із закритим обдувом ?"
        description="Обдув спіралі або випаровувача впливає на смак. Повністю відкритий обдув гарантує вільну затяжку та дає можливість генерувати густий прохолодний пар. З прикритим обдувом пар більш концентрований та насичений."
      />

      <div className="grid grid-cols-[955px_1fr] mt-15">
        <div>
          <h2 className="font-medium text-3xl text-center mb-5">Що таке електронні сигарети</h2>
          <p>
            Електронна сигарета — це пристрій, який працює за рахунок енергії акумулятора, що імітує процес куріння завдяки
            випаровуванню рідини, виготовленої на основі сольового нікотину та інших речовин. Електронка створює відчуття вдихання
            тютюнового диму, хоча насправді відтворює густий щільний пар, який не завдає такої шкоди користувачеві як традиційні
            сигарети. Популярність електронні сигарети здобули тому, що достеменно імітують процес куріння тютюнових виробів, водночас
            у складі рідини може бути присутній або відсутній нікотин. Це допомагає курцям позбутися нікотинової залежності.
          </p>
          <p className="mt-5 mb-5">
            Популярність електронні сигарети здобули тому, що достеменно імітують процес куріння тютюнових виробів. Водночас у складі
            рідини може бути присутнім або відсутнім нікотин. Це допомагає курцям позбутися нікотинової залежності.
          </p>
          <p className="mb-5">Каждое устройство, независимо от вида, состоит из трех основных частей:</p>
          <ul className="list-disc">
            <li>акумулятора: механічного або класичного;</li>
            <li>ємності для ароматичної жижі;</li>
            <li>нагрівального елемента, що перетворює жижу на пар.</li>
          </ul>
          <p className="mb-5 mt-5">
            Уперше електронні сигарети були представлені на китайському ринку. Сьогодні вони набули величезного поширення по всьому
            світу. Їх можна придбати в будь-якому магазині тютюнових виробів, а також у нашому інтернет-магазині за ціною з
            мінімальними націнками.
          </p>

          <h2 className="font-medium text-3xl text-center mb-5">Які бувають види й типи електронок</h2>
          <p>Купити електронку недорого можна, вибравши із представленого асортименту, спираючись на її призначення:</p>
        </div>
        <div>
          <img className="ml-10" src={vape} alt="" width={380} />
        </div>
      </div>
      <div className="mt-5 ">
        <ul className="list-disc flex flex-col gap-2">
          <li>
            Боксмод — комплект для паріння, що складається з атомайзера та елемента живлення. Електронний пристрій дозволяє міняти
            картриджі або створити для себе унікальну рідину. Відрізняється громіздкістю, важкою вагою та баком, що виступає з верхньої
            частини корпусу.
          </li>
          <li className="mt-3 mb-3">
            POD-системи — компактні моделі, що мають вигляд плоскої ручки або невеликої трубки, яка зручно лежить у руці. Картридж для
            рідини одночасно виступає в ролі резервуара та випаровувача.
          </li>
          <li>
            Одноразовий вейп — це електронки з монолітним корпусом, що не дозволяє замінити використану ємність для жижі або заповнити
            її знову. Їх не можна зарядити, тому акумулятор розрахований на певну кількість затяжок і не більше.
          </li>
        </ul>
        <p className="mt-3 mb-3">
          Крім призначення, електронні сигарети можуть відрізнятися за типом затяжки. Сигаретний вейп практично нічим не відрізняється
          від тютюнової сигарети, характеризується малою кількістю пари, тугою тягою та ударом по горлу. Кальянна електронна сигарета
          відрізняється чудовою смакопередачею, утворенням рясного пару та відсутністю «удару» по горлу.
        </p>
        <p>
          Також електронні сигарети діляться на обслуговувані – вони вимагають заміни вати та нагрівального елемента в атомайзері,
          заповнення рідини, – та необслуговувані. Ці види пристроїв не потребують догляду, достатньо купити картридж та атомайзер і
          замінити використані.
        </p>
      </div>

      <h2 className="font-medium text-3xl text-center mb-5 mt-5 ">Переваги електронних сигарет (вейпів)</h2>
      <div className="grid grid-cols-[1070px_1fr] mt-15">
        <div>
          <p className="mb-3">Електронка не втрачає позицій у популярності завдяки таким перевагам:</p>
          <ul className="list-disc flex flex-col gap-2">
            <li>
              Відсутність смол і самого процесу згорання тютюнового листя, що виділяє безліч шкідливих речовин, робить вейпи
              безпечнішими для користувача;
            </li>
            <li>Пристрій допомагає відмовитися від шкідливої звички курити;</li>
            <li>Різноманітність смаків дозволяє розширити смакові враження;</li>
            <li>
              Міцність вейпів має великий вибір градацій, тому кожен підбере для себе відповідний продукт: від міцного до нульовки;
            </li>
            <li>
              Вейпи можна використовувати практично скрізь без обмежень, тому що немає неприємного запаху та шкоди від випаровування
              рідини;
            </li>
            <li>
              Користувач забуде про попільнички та запальнички, а також про пожовклі зуби, які є постійними супутниками курців тютюну;
            </li>
            <li>Можливість багаторазового використання електронних сигарет дозволяє економити гроші.</li>
          </ul>
          <h2 className="font-medium text-3xl text-center mb-5 mt-5 ">Як обрати електронну сигарету</h2>
          <p>
            Багато хто при виборі девайсу спирається на судження: чим дорожче, тим краще. Однак з електронними сигаретами цей підхід не
            спрацює. Необхідно опиратися на характеристику продукції, її виробника та цільовий фактор.
          </p>
        </div>
        <div className="ml-10">
          <img src={electronnaSygareta} alt="" width={270} />
        </div>
      </div>
      <div className="mt-5 mb-5">
        <p>До характерних особливостей електронних сигарет можна віднести:</p>
        <ul className="list-disc flex flex-col gap-2 mt-3 mb-3">
          <li>
            Розміри та вага корпусу. Для щоденного та частого використання краще вибрати компактні POD-системи, які зручно носити в
            кишені.
          </li>
          <li>
            Об'єм ємності для рідини. Цей показник говоритиме про кількість можливих затяжок. У нашому інтернет-магазині можна замовити
            вейп онлайн, розрахований від 300 до понад 2000 затяжок.
          </li>
          <li>
            Ємність акумулятора. Цей показник вимірюється в міліампер-годинах. Чим більше значення, тим більше часу девайс працюватиме
            автономно.
          </li>
          <li>Сучасні електронки можуть протримати заряд близько дня залежно від частоти використання.</li>
          <li>
            Тип керування. Девайс можна активувати за допомогою кнопки «Пуск» або з першої затяжки. Також конструкція може передбачати
            регулювання потужності та виду тяги.
          </li>
          <li>
            Можливість багаторазового та одноразового використання. Для тих, хто не хоче міняти картриджі або заправляти ємність, краще
            вибрати одноразові POD-системи.
          </li>
        </ul>
        <p>Якщо вибирати виробника, то найпопулярнішими вважаються Elf Bar та Vaal, які можна купити в нашому інтернет-магазині.</p>
      </div>

      <div>
        <h2 className="font-medium text-3xl text-center mb-5 mt-5">Вибір марки електронних сигарет для покупки</h2>
        <p>
          Електронні сигарети пропонують різноманіття моделей та характеристик, завдяки чому кожен може обрати пристрій відповідно до
          своїх вподобань. Ось деякі з найбільш відомих брендів, які користуються популярністю серед користувачів:
        </p>
        <ol className="list-decimal flex flex-col gap-2 mt-10 mb-3">
          <li>VAAL — відомий бренд, що пропонує одноразові електронні сигарети з високою ємністю батареї та різноманіттям смаків.</li>
          <li>Elf Bar — бренд одноразових пристроїв, що пропонує довгий термін служби та насичені смаки.</li>
          <li>Vaporesso — виробник, що спеціалізується на високоякісних вейпах з функціями регулювання потужності.</li>
          <li>SMOK — один із лідерів на ринку, що пропонує широкий асортимент пристроїв від компактних вейпів до потужних модів.</li>
          <li>Moti — бренд, відомий своєю міцністю та надійністю, особливо популярний серед досвідчених користувачів.</li>
          <li>
            VooPoo — бренд з різноманітними моделями вейпів, зокрема компактними пристроями для початківців та складнішими моделями для
            досвідчених користувачів.
          </li>
          <li>
            Uwell — бренд, що пропонує широкий асортимент ароматів та надійну якість, популярний як серед новачків, так і серед
            досвідчених вейперів.
          </li>
        </ol>
        <p>
          Кожен із цих брендів пропонує унікальні особливості та різноманіття смаків, дозволяючи підібрати пристрій для паріння під
          будь-який стиль та вподобання.
        </p>
      </div>

      <section>
        <h2 className="font-medium text-3xl text-center mb-5 mt-5 ">Вартість електросигарет</h2>
        <p>
          Середньостатистичний курець може викурити від 20 сигарет на добу, витрачаючи щомісяця гроші, порівнянні з покупкою
          багаторазової електронки та рідини, запасу якої вистачить на рік. Тому електронна сигарета дозволить заощадити.
        </p>
        <p className="mt-5 mb-5">
          Ціна девайсу залежить від безлічі факторів, починаючи від 250 грн за одноразовий пристрій. Найдорожчі пристрої — це мод-блоки
          та комплекти, багаторазове використання яких виправдовує таку вартість. Стильні, багатофункціональні та високопродуктивні
          вейпи також вийдуть дорожче порівняно з простими моделями.
        </p>
      </section>

      <section>
        <h2 className="font-medium text-3xl text-center mb-5 mt-5 ">Як замовити електронку</h2>
        <p>
          Замовити електронну сигарету в нашому онлайн-магазині можливо через кошик покупок, заповнивши невелику форму замовлення.
          Також можна скористатися допомогою менеджера, який надасть консультацію у виборі відповідного девайса та оформить покупку в
          телефонному режимі.
        </p>
        <p className="mt-5 mb-5">
          Ми пропонуємо тільки оригінальний товар від світових брендів, велике розмаїття асортименту, який завжди в наявності, та
          доступні ціни. Доставка здійснюється транспортними службами по всій Україні. Оплатити замовлення можливо переказом на
          реквізити або при отриманні післяплатою.
        </p>
      </section>

      <Delivery />
    </>
  );
};

export default ElectronCigarettePage;
