const Partnership = () => {
  return (
    <>
      <h2 className="text-center text-3xl font-medium mt-10 mb-5">Співпраця з компанією Kalyan For Everyone</h2>
      <p className="font-bold mb-5">З питань співробітництва та оптових замовлень +38(093)561-21-97</p>
      <p>
        Ми працюємо для справжніх аматорів кальянів! Працюємо з душею та задоволенням, починаючи з 2010 року. Основною метою команди
        від початку своєї діяльності був якісний сервіс для всіх клієнтів. Адже задоволений покупець – ndash; запорука довгострокового
        співробітництва!
      </p>
      <p className="mt-5 mb-5">Продаж кальянів не тільки в роздріб, а й оптом дозволив значно розширити нашу клієнтську базу. </p>
      <p>
        Це вигідно як нам, так і вам: на нашому складі завжди є достатня кількість товару, щоб задовольнити будь-який попит покупців з
        усіх регіонів України. Оптимальне поєднання ціни та якості є тільки у нас.
      </p>
      <p className="mt-5 mb-5">
        Завдяки професійному сервісу, ми завжди готові запропонувати нашим покупцям виняткові умови для співпраці. Оптові покупці
        можуть придбати кальяни оптом в Україні та тютюн для кальяну оптом у будь-який час доби, а ми обробляємо їх у найкоротший
        термін. Будь-які спірні питання завжди вирішуються на користь наших клієнтів.
      </p>

      <h2 className="text-2xl font-medium text-center ">Переваги роботи з нами:</h2>
      <p className="mb-5 mt-5">Оптове замовлення тютюну для кальяну за найвигіднішими цінами;</p>
      <ul className="list-disc px-10 mb-5">
        <li>якісні сертифіковані товари;</li>
        <li>великий вибір продукції, що завжди є;</li>
        <li>оперативна доставка та обробка замовлень;</li>
        <li>ціни нижчі, ніж у конкурентів;</li>
        <li>широкий асортимент.</li>
      </ul>
      <p>
        Закупівля кальянів за оптовою ціною стала дуже поширеною останнім часом. Вся справа, звичайно ж, у значній економії коштів,
        особливо якщо вам потрібні кальяни для кафе чи ресторану. При цьому постійні покупці можуть розраховувати на додаткові знижки.
        Багато клієнтів вважають це вирішальним аспектом і тому звертаються до нас знову і знову.
      </p>
      <p className="mt-5 mb-5">
        Ми ретельно стежимо за наявністю всіх товарів, представлених на сайті, щоб гарантувати їхню доступність завжди. Це дозволяє нам
        робити відправку максимально швидко, навіть у найзавантаженіші дні, адже від цього залежить наша репутація. Багато закладів
        співпрацюють тільки з нами, оскільки впевнені як товар та його наявність.
      </p>
      <p>
        Не може бути ситуації, коли популярний та затребуваний товар відсутній на складі. Обмежень у замовленні товару у нас немає,
        тому якщо ціна вас влаштовує, ви зможете придбати в одні руки стільки, скільки вам потрібно. Асортимент продовжує
        збільшуватися, тому слідкуйте за новинками і поспішайте придбати тютюн для кальяну оптом саме у нас, адже на Vipkalyan.com ви
        знайдете тільки якісний товар за найзручнішою ціною!
      </p>
    </>
  );
};

export default Partnership;
