import Acardion from "../../../components/Acardion";

const AboutUs = () => {
  return (
    <>
      <div className="mt-20 text-[0.9rem]">
        <h2 className="font-medium text-3xl text-center mb-5">Інтернет-магазин кальянів та електронних сигарет VipKalyan</h2>
        <p>
          Якщо покупцеві потрібно придбати кальяни, комплектуючі до них і аксесуари оригінальної якості за доступною ціною, то
          кальянний інтернет магазин VipKalyan - це той самий майданчик, який може надати такий товар. Весь асортимент магазину від
          відомих у всьому світі виробників, а також брендів, що стрімко набирають популярність не тільки в Україні, а й за її межами.
        </p>
        <p className="mt-5 mb-5">
          Завдяки налагодженій роботі менеджерів інтернет-магазину вдалося зібрати різноманітну продукцію, здатну задовольнити смак
          вимогливого покупця. Зручна навігація сайту дає змогу легко орієнтуватися в представленому товарі та підібрати той, що
          найбільше підходить покупцеві. Також наші фахівці допоможуть зробити вибір і купити все для кальяну: починаючи з витратних
          матеріалів до самого пристрою для куріння.
        </p>
        <p>
          При оформленні замовлення, клієнт VipKalyan може бути впевнений в його якості, оскільки магазин надає гарантії, і в
          доступності ціни, оскільки ми працюємо безпосередньо з виробником. Це дозволяє знизити націнку і запропонувати вигідний
          прайс, а також дає можливість робити знижки на популярні категорії товару.
        </p>

        <h2 className="font-medium text-3xl text-center mb-5 mt-5">Наш асортимент: від тютюну для кальянів до POD-систем</h2>
        <p className="mb-3">На сайті VipKalyan представлено широке розмаїття товару. Він розділений на такі категорії:</p>
        <ul className="list-decimal">
          <li>
            <span className="font-bold">Кальяни. </span>
            <span>
              Онлайн магазин кальянів пропонує сучасні вироби, виконані з високоміцного скла і якісної сталі, що володіють оригінальним
              дизайном, а також традиційні східні моделі з авторськими розписами. Можна вибрати високий пристрій до 80 см або один з
              популярних розмірів 40-50 см. Також є кальяни для одиночного сеансу або дружної компанії з 2, 4 або 5 трубками. Доступний
              вибір і за країною виготовлення виробу: Україна, США, Німеччина, Туреччина тощо.
            </span>
          </li>

          <li>
            <span className="font-bold">Тютюн для кальяну.</span>
            <span>
              На сайті представлений величезний асортимент різноманітних смаків і міцності. Тютюнові вироби можуть мати нікотин у
              складі або бути безнікотиновими, вимагати акліматизації або підійдуть для використання відразу після розпакування.
              Інтернет магазин тютюну для кальяну пропонує скористатися консультацією для вибору кращої продукції, використовуючи такі
              критерії, як наявність ароматизаторів наповнювачів, складу і вартості продукту.
            </span>
          </li>
          <li>
            <span className="font-bold ">Аксесуари для кальяну. </span>
            <span>
              У цю категорію товарів входить великий перелік аксесуарів таких, як охолоджувачі, перехідники, шланги, чаші, щипці,
              калауди, ковпаки, клапани, ущільнювачі, перенесення, мундштуки та багато іншого. Також можна замовити все для
              розпалювання і чищення кальяну.
            </span>
          </li>
          <li>
            <span className="font-bold ">Електронні сигарети. </span>
            <span>
              Вейп магазин має в асортименті одноразові електронні сигарети, бокс моди, багаторазові Pod-системи та витратні матеріали
              до них: рідину для паріння, випаровувачі та картриджі. Покупець може вибрати пристрій за смаком, типом затяжки (кальянні
              або сигаретні), електронні сигарети, що обслуговуються та не обслуговуються, від світових брендів.
            </span>
          </li>
          <li>
            <span className="font-bold ">Рідини для електронних сигарет. </span>
            <span>
              У каталозі вейпшопа сайту VipKalyan ви знайдете великий вибір рідин для електронних сигарет різних брендів і смаків. У
              наявності як класичні тютюнові та фруктові смаки, так і оригінальні мікси з охолоджувальним або десертним післясмаком.
              Можна вибрати рідини з різним вмістом нікотину або безнікотинові варіанти. Вся продукція сертифікована і підходить для
              всіх типів електронних сигарет і POD-систем. Щоб вибрати товар, потрібно перейти в категорію, скористатися фільтром і
              підібрати найбільш підходящу за ціною.
            </span>
          </li>
        </ul>

        <h2 className="font-medium text-3xl text-center mb-5 mt-5 ">Переваги покупки в нашому інтернет-магазині</h2>
        <p>Магазин кальянної та вейп продукції може запропонувати покупцям такі переваги покупок:</p>
        <ul className="text-[1rem] mt-3 px-10 list-disc">
          <li>кілька ступенів перевірки якості товару, що дозволяє давати гарантії клієнтам VipKalyan;</li>
          <li>доступність цінової політики як на бюджетну, так і на преміальну продукцію;</li>
          <li>доброзичливий і кваліфікований сервіс;</li>
          <li>можливість замовляти зі знижкою і брати участь в акціях;</li>
          <li>є умови безкоштовної доставки для городян Харкова - від 1000 грн покупки;</li>
          <li>широкий асортимент дозволяє придбати всі необхідні товари в одному магазині;</li>
          <li>є вейп шоп, який також містить великий вибір пристроїв і комплектуючих;</li>
          <li>при виборі та оформленні покупки можна скористатися допомогою фахівця.</li>
        </ul>
      </div>

      <h2 className="font-medium text-3xl text-center mb-5 mt-5">
        VipKalyan: кальянна продукція та електронні сигарети з доставкою по всій Україні
      </h2>
      <p>Доставка замовлення здійснюється кількома способами:</p>
      <ul className="px-10 list-disc mt-3">
        <li>
          <span className="font-bold ">Новою Поштою (по країні). </span> Можливе за умови суми покупки від 150 грн. Товар
          відправляється за 100% передоплатою або ж післяплатою.
        </li>
        <li>
          <span className="font-bold ">Самовивіз (з наземних магазинів VipKalyan). </span> Послуга попередньо обговорюється з
          менеджером. Коли можна забрати товар повідомляється в смс-повідомленні.
        </li>
        <li>
          <span className="font-bold ">Кур'єрська доставка (у місті Харків). </span>Сума замовлення має бути від 300 грн плюс вартість
          транспортування - 75 грн. Товар доставляється з 10-00 до 19-00.
        </li>
      </ul>

      <Acardion
        title="Які товари можна купити в інтернет-магазині VipKalyan?"
        description="У VipKalyan ви знайдете широкий асортимент: кальяни різних розмірів і дизайну, тютюн для кальяну різних брендів і смаків, вугілля для розведення кальяну (деревне, кокосове), аксесуари для кальяну, а також великий вибір електронних сигарет і POD-систем із розхідниками до них і великий асортимент смаків електронних рідин для вейпінгу."
      />
      <Acardion
        title="Чи є гарантії якості продукції?"
        description="Так! Ми працюємо тільки з перевіреними виробниками і проводимо багатоступеневу перевірку якості. На всі товари надаємо гарантію."
      />
      <Acardion
        title="Чи можна розраховувати на знижки або акції?"
        description="Звичайно! У VipKalyan регулярно діють знижки та акції на популярні товари. Слідкуйте за новинами на сайті або підпишіться на розсилку, щоб не пропустити вигідні пропозиції для кальянокуріння або вейпінгу."
      />
    </>
  );
};

export default AboutUs;
