import type { TabaccoProduct } from "../../../../../types/product";

import dragonfruit_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_dark_100gr_dragonfruit.webp";
import grapefruit_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_dark_100gr_grapefruit.webp";
import peach_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_dark_100gr_peach.webp";
import redCurrant_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_dark_100gr_redCurrant.webp";
import kiwi_smoothie_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_dark_line_100gr_kiwi_smoothie.webp";
import creamLiquor_dark_100gr from "../../../../../imgs/tabaks/420/100gr_darkLine/420_darkLine_creamLiquor.webp";

export const darkLine100grProducts: TabaccoProduct[] = [
  {
    id: "420_darkLine_100gr_dragonFruit",
    name: "Тютюн 420(Чотири Двадцять) Dark Line DragonFruit (Драконів Фрукт) 100гр",
    price: 300,
    imgUrl: dragonfruit_dark_100gr,
    having: true,
    about: {
      sweet: 4,
      sour: 0,
      spicy: 1,
      fresh: 0,
      taste: "Пітайя",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line DragonFruit (Драконів Фрукт) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
  {
    id: "420_darkLine_100gr_grapefruit",
    name: "Тютюн 420(Чотири Двадцять) Dark Line Grapefruit (Грейпфрут) 100гр",
    price: 300,
    imgUrl: grapefruit_dark_100gr,
    having: true,
    about: {
      sweet: 1,
      sour: 3,
      spicy: 0,
      fresh: 0,
      taste: "Грейпфрут",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line Grapefruit (Грейпфрут) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
  {
    id: "420_darkLine_100gr_neastyPeach",
    name: "Тютюн 420(Чотири Двадцять) Dark Line Neasty Peach (Персик) 100гр",
    price: 300,
    imgUrl: peach_dark_100gr,
    having: true,
    about: {
      sweet: 4,
      sour: 0,
      spicy: 0,
      fresh: 0,
      taste: "Персик",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line Neasty Peach (Персик) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
  {
    id: "420_darkLine_100gh_redCurrant",
    name: "Тютюн 420(Чотири Двадцять) Dark Line Red Currant (Червона Смородина) 100гр",
    price: 300,
    imgUrl: redCurrant_dark_100gr,
    having: true,
    about: {
      sweet: 1,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Червона Смородина",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line Red Currant (Червона Смородина) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
  {
    id: "420_darkLine_100gr_kiwiSmoothie",
    name: "Тютюн 420(Чотири Двадцять) Dark Line Kiwi Smoothie (Ківі Смузі) 100гр",
    price: 300,
    imgUrl: kiwi_smoothie_dark_100gr,
    having: true,
    about: {
      sweet: 3,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Ківі, Коктейль",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line Kiwi Smoothie (Ківі Смузі) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
  {
    id: "420_darkLine_100gr_cream_Liquor",
    name: "Тютюн 420(Чотири Двадцять) Dark Line Cream Liquor (Крем Лікер) 100гр",
    price: 300,
    imgUrl: creamLiquor_dark_100gr,
    having: false,
    about: {
      sweet: 4,
      sour: 0,
      spicy: 3,
      fresh: 0,
      taste: "Лікер,Вершки",
      tough: "Середня",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
      country: "Україна",
    },
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Dark Line Cream Liquor (Крем Лікер) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
  },
];
