import type { ContentBlock } from "../../../../../types/data";

export const tabacco420Description100gr: ContentBlock[] = [
  {
    header: "Якісний тютюн для кальяну 4:20 в упаковці 100 грам",
    description1:
      "Тютюн для кальяну 4 20 упаковкою 100 гр є винятковим продуктом, який створювався для справжніх цінителів кальянної справи. Всі елементи, що входять до складу, ретельно підбиралися, враховуючи найвищі стандарти якості.",
    description2:
      "Продукт містить у собі унікальні тютюнові сорти, які були ретельно відібрані та збалансовані. У такий спосіб вдалося домогтися неповторного смаку й аромату.",
    description3:
      "Унікальність тютюну полягає в тому, що кожна його складова піддається суворому контролю якості. Це свого роду гарантія того, що купуючи цей продукт, ви отримуєте безсумнівну якість. Тютюн 420 фасування сто грам - відмінне рішення для тривалої насолоди. Тепер вам не потрібно постійно поповнювати запаси. Це не тільки зручно, але й практично для тих, хто любить насолодитися вейпінгом у колі близьких друзів.",
    conclusion1:
      "Купуючи тютюн, ви точно можете розраховувати на інтенсивний смак і густу хмару диму. Серед широкого асортименту можна знайти як легкі фруктові відтінки, так і насичені тютюнові ноти.",
  },
  {
    header: "Характеристики тютюну 420 (100 гр)",
    description1: "Цей тютюн має низку переваг, серед яких хотілося б відзначити таке:",
    listItems: {
      liItem1: "Cередня міцність - відмінне рішення як для досвідчених курців, так і для новачків у цій справі",
      liItem2:
        "Широке розмаїття смаків. На сьогоднішній день виробник пропонує понад двадцять ароматів. Тому, кожен зможе знайти ідеальний для себе варіант",
      liItem3: "Зручна упаковка",
      liItem4: "Жаростійкість високого ступеня. Тепер можна не боятися того, що тютюн перегріється, а смак стане гірким",
      liItem5: "Адекватна вартість",
    },
  },
  {
    header: "Легкий ",
    description1:
      "Легкий тютюн став ідеальним рішенням для тих, хто любить кальянні сесії з неймовірно м'яким смаком. Також відмінно підійде для курців-початківців, оскільки він досить м'який, але водночас димний, що дасть змогу повністю відчути весь спектр відчуттів від куріння.",
  },
  {
    header: "Більш міцний",
    description1:
      "Для любителів насичених і сильних смакових відчуттів, виробник пропонує більш міцний тютюн. Він підходить для справжніх цінителів куріння.",
    description2: "З таким тютюном кожен охочий може з головою зануритися в глибокі та інтенсивні відтінки. ",
  },
  {
    header: "Чайна суміш",
    description1:
      "Чайна суміш є ідеальним поєднанням смаків та ароматів. За допомогою високоякісних сортів чайного листа створюється запаморочлива суміш для кальяну. У неї насичений аромат і за рахунок того, що листя більш щільне ніж тютюнове, смаком насолоджуватися можна набагато довше.",
  },
  {
    header: "Серед топових смакових переваг ",
    description1: "На сьогоднішній день виробник пропонує величезний вибір ароматів, які між собою можна розділити на такі категорії:",
    listItems: {
      liItem1: "Фрукти",
      liItem2: "Ягоди",
      liItem3: "Десерти",
      liItem4: "Коктейлі",
    },
  },
  {
    header: "Чому варто купити тютюн 4:20 фасуванням 100 грам? ",
    description1:
      "Обираючи тютюн, варто спиратися не тільки на свої смакові переваги, а й на досвід. Останнім часом тютюн 4:20 100 грам користується великим попитом завдяки зручному фасуванню і різноманітності смаків. З ним можна в будь-який час насолодитися вишуканим ароматом.",
    description2:
      "Висока якість і відповідність усім сучасним стандартам точно не залишить вас байдужим. Купити 420 упаковку 100 грам пропонує інтернет-магазин 'ВіпКальян' за дуже вигідною доставкою та з оперативною доставкою. Також на сайті ви зможете підібрати і купити кальян від відомих виробників. Продукція має високу якість і відповідає всім стандартам.",
  },
];
