const ForWholesalers = () => {
  return (
    <>
      <h2 className="text-center text-3xl font-medium mt-10 mb-5">Оптовим покупцям</h2>
      <p>
        Кальян - справжня прикраса бару або кафе, що приваблює відвідувачів чарівним смаком солодкого тютюну і чарівною атмосферою
        сходу.
      </p>
      <p className="mt-5 mb-5">
        Уже понад п'ять років ми постачаємо кальяни та аксесуари до них. Можемо впевнено сказати, що з кожним роком популярність тільки
        зростає. Хочете, щоб задоволені клієнти раз по раз поверталися до вашого закладу, замовте кальяни оптом у нашому
        інтернет-магазині.
      </p>
      <p>
        Запитаєте в чому секрет - все дуже просто. Ми ретельно стежимо за якістю продукції і пропонуємо найкращі моделі кальянів від
        відомих виробників: Starbuzz, Sheriff, ЕМІ, AGER та інших. Такі кальяни неодмінно принесуть відвідувачам багато радості та
        задоволення, а власників кальянів потішать гарною виручкою.
      </p>
      <p className="mt-5 mb-5">
        До того ж кальяни оптом у Києві зі складу обійдуться вам значно дешевше, ніж роздрібна покупка. Замовляючи продукцію на
        vipkalyan.com.ua, ви гарантовано отримуєте красиві та якісні кальяни, які прослужать довгий час.
      </p>
      <p>В оптовому інтернет-магазині кальянів vipkalyan.com.ua ви можете придбати:</p>
      <ul className="list-disc mt-5 mb-5 px-10">
        <li>Екзотичні, традиційні та дизайнерські кальяни відомих виробників;</li>
        <li>Всі необхідні комплектуючі та аксесуари;</li>
        <li>
          Найпопулярніші тютюн: Al-Fakher, HAZE, ALCHEMIST, STARBUZZ, ARAVIA PLATINUM, SOCIAL SMOKE, AL-WAHA, ФУМАРІ, АФЗАЛ, НІРВАНА.
        </li>
        <li>Вугілля: COCOLOCO</li>
      </ul>
      <p>Чому з нами вигідно працювати:</p>
      <ul className="list-disc mt-5 mb-5 px-10">
        <li>Оптовий продаж кальянів зі складу з доставкою по всій Україні;</li>
        <li>Широкий асортимент продукції - найкращі кальяни та аксесуари від найвідоміших виробників;</li>
        <li>Доступні ціни - будьте впевнені, ваше замовлення швидко окупиться;</li>
        <li>Швидке відправлення і доброзичливий сервіс.</li>
      </ul>
    </>
  );
};

export default ForWholesalers;
