import BtnShowMoreProducts from "../../components/Buttons/BtnShowMoreProducts";
import Filters from "../../components/Filters";
import GoodsCategories from "../../components/GoodsCategories";
import GoodsList from "../../components/GoodsList";
import SelectPagePannel from "../../components/SelectPagePannel";

import astiTabacco from "../../imgs/tabaks/asti/tabak_asti_100gr.jpg";
import skittlesTabacco from "../../imgs/tabaks/420/420_light_100gr_skitls.webp";
import Delivery from "../../components/Delivery";
import Acardion from "../../components/Acardion";

const TabaccoPage = () => {
  return (
    <>
      <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Тютюн</h2>
      <div className="grid grid-cols-[280px_1fr]">
        <div>
          <Filters />
        </div>
        <div>
          <GoodsCategories />
          <div className="grid grid-cols-4 mt-3">
            <GoodsList />
          </div>
          <div>
            <div className="flex justify-center text-center mt-5">
              <BtnShowMoreProducts />
            </div>
            <div>
              <SelectPagePannel />
            </div>
          </div>
        </div>
      </div>
      <div>
        <section>
          <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Тютюн для кальяну</h2>
          <p>
            Куріння кальяну вже давно стало приємною звичкою більшості українців. І якщо раніше, щоб смачно подиміти, потрібно було
            вирушати в кальянну, то зараз кожен може організувати таке дозвілля вдома. Купити тютюн для кальяну, який дійсно буде
            смачним і димним, відповідатиме заявленим виробником характеристикам, рекомендується в спеціалізованих магазинах. Сьогодні
            вітчизняні та зарубіжні виробники намагаються випускати всі лінійки тютюну, щоб задовольнити запити кальянщиків-початківців
            і професійних. За основу береться різна сировина:
          </p>
          <ul className="flex flex-col gap-3 list-disc mt-5 mb-5 pl-10 ">
            <li>Вірджинія - жаростійкий з легкою смакопередачею;</li>
            <li>Берлі - міцний сорт із терпким насиченим смаком;</li>
            <li>Орієнталь - м'який смак із кислинкою;</li>
            <li>Мерілен - ранній сорт із легким смаком.</li>
          </ul>
          <p>Хороший тютюн для кальяну - це хороша рецептура з витриманою технікою виробництва. </p>
        </section>

        <section>
          <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Види тютюну для кальяну</h2>
          <div className="grid grid-cols-[1000px_1fr]">
            <div>
              <p>
                Заправка для кальяну - це не чистий тютюновий лист. Як правило, кожен виробник використовує власні рецепти,
                використовує певну тютюнову сировину та ароматизатори. Умовно тютюн можна розділити на три категорії.
              </p>
              <p className="mt-5 mb-5">
                <span className="font-bold">Муассель</span> - суміш зі спеціально підготовленого тютюнового листа, ароматизатора,
                патоки та гліцерину. Крафтовий тютюн може містити різні натуральні наповнювачі або добавки. Це найпоширеніший вид,
                придбати який можна в будь-якому онлайн магазині. За основу муасселя беруть тютюновий лист:
              </p>
              <ul className="list-disc pl-10">
                <li>Virginia - класичний м'який з приємним м'яким смаком і легким присмаком, з мінімальним вмістом смол;</li>
                <li>Burley - тютюновий лист із підвищеною міцністю, чистим смаком, м'якою тягою, що не ріже горло.</li>
                <li>Муассель - це найпоширеніша тютюнова суміш, яка використовується і вдома, і в спеціалізованих закладах. </li>
              </ul>
              <p className="mt-5 mb-5">
                <span className="font-bold">Томбак</span> - це чисте тютюнове листя, яке пройшло спеціальну підготовку: нарізка,
                вимочування, сушка. Досить міцний, без ароматизаторів і добавок. Під час розкурювання такого кальяну відчувається його
                міцність ударом по горлу: він підійде винятково шанувальникам міцних покурів. Забивати томбак потрібно вимоченим і
                віджатим, ціле листя намотується на шахту і розігрівається вугіллям.
              </p>
              <p>
                <span className="font-bold">Журак</span> - це суміш муасселя і томбака. Дрібно нарізане тютюнове листя змішується з
                патокою, але не ароматизаторами. У результаті отримуємо середню міцність із приємним натуральним смаком. Забивання
                журака щільне, в чашу, вугілля укладається безпосередньо на масу.
              </p>
            </div>
            <div>
              <img src={astiTabacco} alt={"Види тютюну для кальюну"} width={300} />
            </div>
          </div>
        </section>
        <section>
          <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Популярні бренди тютюну для кальяну</h2>
          <p>
            Сьогодні практично в кожній країні виробляють тютюн для кальяну. Зарубіжні та вітчизняні українські виробники в умовах
            конкуренції дивують кальянщиків новими смаками і складами.
          </p>
          <ul className=" flex flex-col gap-2 mt-5 mb-5 list-disc pl-10">
            <li>
              SERBETLI - турецький тютюн середнього цінового сегмента, представлений у широкому асортимент. Бренд пропонує понад 200
              смаків і свою особисту рецептуру - йогуртові мікси. Легкий, жаростійкий і в міру димний продукт.
            </li>
            <li>
              BUTA - йорданський продукт, що випускається двома лінійками, легкий і міцний. Загалом виробник пропонує близько 40
              смаків.
            </li>
            <li>
              LIRRA - новий тютюн із Туреччини. Головним компонентом тютюнової продукції є лист сорту Вірджинія. Для отримання якісної
              продукції застосовуються натуральні якісні ароматизатори.
            </li>
            <li>
              CULTt - це кальянний тютюн німецької компанії Gulbahar. Продукт відмінно куриться, має довгограючий аромат. Смак
              розкривається дуже швидко.
            </li>
            <li>
              MILANO - німецький тютюн преміум-класу. Головна перевага - легкість, що дозволяє використовувати тютюн як новачкам, так і
              досвідченим курцям. Неймовірна увага до деталей під час створення цього кальянного тютюну зробила тютюн воістину
              унікальним.
            </li>
            <li>
              GIXOM - легкий турецький тютюн для кальяну. Виробник використовує якісні тютюнові листи, просочені натуральним медом.
              Сорт Virginia Gold часто береться за основу для отримання продукту середньої міцності.
            </li>
            <li>
              4:20 - український продукт, який становить конкуренцію відомим закордонним брендам. Виробляється двома лінійками -
              кальянний тютюн або чайний лист в основі, доповнений якісними ароматизаторами.
            </li>
          </ul>
        </section>
        <section>
          <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Як вибрати тютюн?</h2>
          <div className="grid grid-cols-[1000px_1fr]">
            <div>
              <p>
                Наш онлайн магазин тютюну для кальяну пропонує дуже великий вибір. Вибираючи суміш, варто враховувати деякі критерії:
              </p>
              <ul className="flex flex-col gap-1 pl-10 list-disc mt-5 mb-5">
                <li>міцність</li>
                <li>димність</li>
                <li>необхідність попередньої підготовки</li>
                <li>простота забивання</li>
                <li>склад</li>
                <li>смак</li>
              </ul>
              <p>
                Якщо Ви курець-початківець або хочете урізноманітнити свою колекцію тютюнових сумішей, наші консультанти завжди
                допоможуть зробити вибір, який задовольнить усі Ваші вимоги. Купуючи новий тютюн онлайн, прислухайтеся до порад щодо
                забивання: так Ви зможете розкрити смакові якості та отримати максимум задоволення від ароматного куріння. Ми
                гарантуємо якість реалізованої продукції: купуючи в нас, Ви можете розраховувати на швидке обслуговування, завжди свіжі
                продукти та приємні ціни.
              </p>
            </div>
            <div>
              <img src={skittlesTabacco} alt="Як вибрати тютюн" width={300} />
            </div>
          </div>
        </section>
        <section>
          <h2 className="text-center mt-10 mb-5 text-3xl font-medium">Переваги комфортних покупок тютюну для кальяну з VipKalyan</h2>
          <p>
            Тютюн для кальяну і чайні заправки до кальянів доступні майже скрізь, але багато хто усвідомлює, що в більшості місць
            продаються недорогі аналоги з невідомим хімічним складом, який може становити небезпеку для здоров'я людини! Наш
            інтернет-магазин кальянного тютюну Vipkalyan.com з продажем кальянного тютюну успішно працює вже багато років і має безліч
            позитивних відгуків, що підтверджують високу якість послуг, що надаються.
          </p>
          <p className="mt-5">Чому варто вибрати саме нас для покупки тютюну для кальяну:</p>
          <ul className="flex flex-col gap-1 mt-5 mb-5 pl-10 list-disc">
            <li>Прийнятні ціни на весь асортимент.</li>
            <li>Вигідні умови для оптових закупівель.</li>
            <li>Накопичувальна система знижок та акцій для клієнтів.</li>
            <li>Швидка доставка і надійне пакування товару.</li>
            <li>Оплата при отриманні через послугу "Нова Пошта".</li>
            <li>Пізнавальний кальянний блог на нашому сайті.</li>
          </ul>
          <p>
            Замовити тютюн для кальяну можна онлайн, поклавши необхідні товари у віртуальний кошик. Вкажіть адресу доставки та
            контактний телефон, щоб наш співробітник міг зв'язатися з вами для уточнення інформації. Є питання? Телефонуйте нам за
            номером +38 (093) 561-21-97!
          </p>
        </section>
        <Delivery />
        <Acardion
          title="Який тютюн для кальяну краще димить?"
          description="Димність кальяну не залежить від самого тютюну. На цей показник впливає ціла низка критеріїв: насамперед - тяга. Чим вона краща, тим більше втягується повітря, а на видиху - пари."
        />
        <Acardion
          title="Як вибрати тютюн для кальяну за міцністю?"
          description="На міцність тютюну впливає концентрація нікотину. Відсоткова частка його визначається сортом тютюнового листа: кожен сорт містить різну кількість цієї речовини. А міцність готового продукту прописується на упаковці виробником."
        />
        <Acardion
          title="Як зрозуміти міцний тютюн чи ні?"
          description="Запитайте у наших консультантів або читайте опис продукту. Слабкий або легкий (light) тютюн містить до 1% нікотину, середній (medium) до 2%, міцний (strong) до 3% і найміцніший (extra strong) до 4%"
        />
        <Acardion
          title="Який кальян курити новачкові?"
          description="Для кальянщиків-початківців ми рекомендуємо світлі сорти. Вони відрізняються малою міцністю, містять низьку концентрацію нікотину. При курінні такого кальяну не виникає відчуття печіння, першіння в горлі."
        />
      </div>
    </>
  );
};

export default TabaccoPage;
