import type { CategoryDescription } from "../../../../../types/data";

export const tabacco420Description250gr: CategoryDescription = [
  {
    header: "Тютюн 420(Чотири Двадцять) 250 грам",
    description1:
      "Тютюн 4:20 преміум-класу представлений різноманітними смаками, які постійно поповнюються новими варіантами. Тут не обмежуються простими фруктовими ароматами, а пропонують складні мікси, що об'єднують кілька смакових відтінків. Ви можете купити тютюн 420 250 гр, тому що він легко підтримує форму всередині колби та демонструє відмінні характеристики жароміцності й димоутворення. Ароматизатори, що використовуються у виробництві, імпортуються зі США, Франції та Німеччини.",
  },
  {
    header: "Продукт виробництва українського бренду '4:20'",
    description1:
      "Спочатку компанія виробляла тютюн 4:20 250 гр, упакований у поліетиленові пакети. Однак цей варіант не вразив досвідчених курців кальяну, тому було вирішено провести повний ребрендинг, в результаті чого з'явився тютюн 4:20. З моменту входу на ринок відбулися зміни не тільки в самому продукті, а й у його упаковці. Тепер це стильні чорні банки з вакуумною кришкою, які забезпечують тривале збереження свіжості та смакових якостей.",
  },
  {
    header: "Особливості тютюну 420(Чотири Двадцять) 250 гр ",
    description1:
      "Насамперед тютюн для кальяну 420 250 грам вітчизняного виробництва, що вже важливо. Він відрізняється високою міцністю, роблячи його кращим вибором для завзятих кальянщиків, ніж для новачків. Проте, для досягнення більш ніжного смаку без вираженої гіркуватості, можна спробувати залишити тютюн відкритим на ніч. Згодом рекомендується зберігати його в герметичній упаковці.",
  },
  {
    header: "Склад і смаки тютюн для кальяну 420(Чотири Двадцять) 250 грам ",
    listItems: {
      liItem1: "Northern Berries: суміш північних ягід приносить вам яскраві та натуральні аромати півночі.",
      liItem2: "Orange Zest: сицилійський апельсин приносить соковиту й ароматну цитрусову солодкість.",
      liItem3: "Pistacchio Cream: фісташкове морозиво зливається з ніжною кремовою ноткою, створюючи смачний десерт.",
      liItem4: "Scotch Whisky: віскі, що переносить у затишний шотландський паб.",
      liItem5: "Strawberry Jam: домашній полуничний джем наповнює вас солодким і ароматним задоволенням.",
    },
    conclusion1:
      "Аромати, що зачаровують, з неповторними враженнями. Тому купити тютюн для кальяну 4:20 250 гр можна з будь-якого приводу, для кожної вечірки або зустрічі з друзями.",
  },
  {
    header: "Чайна суміш",
    description1:
      "Чайна суміш є ідеальним поєднанням смаків та ароматів. За допомогою високоякісних сортів чайного листа створюється запаморочлива суміш для кальяну. У неї насичений аромат і за рахунок того, що листя більш щільне ніж тютюнове, смаком насолоджуватися можна набагато довше.",
  },
  {
    header: "Серед топових смакових переваг ",
    description1: "На сьогоднішній день виробник пропонує величезний вибір ароматів, які між собою можна розділити на такі категорії:",
    listItems: {
      liItem1: "Фрукти",
      liItem2: "Ягоди",
      liItem3: "Десерти",
      liItem4: "Коктейлі",
    },
  },
  {
    header: "Чому варто купити тютюн 4:20 фасуванням 100 грам? ",
    description1:
      "Обираючи тютюн, варто спиратися не тільки на свої смакові переваги, а й на досвід. Останнім часом тютюн 4:20 100 грам користується великим попитом завдяки зручному фасуванню і різноманітності смаків. З ним можна в будь-який час насолодитися вишуканим ароматом.",
    description2:
      "Висока якість і відповідність усім сучасним стандартам точно не залишить вас байдужим. Купити 420 упаковку 100 грам пропонує інтернет-магазин 'ВіпКальян' за дуже вигідною доставкою та з оперативною доставкою. Також на сайті ви зможете підібрати і купити кальян від відомих виробників. Продукція має високу якість і відповідає всім стандартам.",
  },
];
