import type { ContentBlock } from "../../types/data";

import astiTabacco from "../../imgs/tabaks/asti/tabak_asti_100gr.jpg";
import skittlesTabacco from "../../imgs/tabaks/420/100gr_lightLine/420_light_100gr_skitls.webp";

export const tabaccoPageDescriptionContent: ContentBlock[] = [
  {
    header: "Тютюн для кальяну",
    description1:
      "Куріння кальяну вже давно стало приємною звичкою більшості українців. І якщо раніше, щоб смачно подиміти, потрібно було вирушати в кальянну, то зараз кожен може організувати таке дозвілля вдома. Купити тютюн для кальяну, який дійсно буде смачним і димним, відповідатиме заявленим виробником характеристикам, рекомендується в спеціалізованих магазинах. Сьогодні вітчизняні та зарубіжні виробники намагаються випускати всі лінійки тютюну, щоб задовольнити запити кальянщиків-початківців і професійних. За основу береться різна сировина:",
    listItems: {
      liItem1: "Вірджинія - жаростійкий з легкою смакопередачею",
      liItem2: "Берлі - міцний сорт із терпким насиченим смаком",
      liItem3: "Орієнталь - м'який смак із кислинкою",
      liItem4: "Мерілен - ранній сорт із легким смаком",
    },
    conclusion1: "Хороший тютюн для кальяну - це хороша рецептура з витриманою технікою виробництва.",
  },
  {
    header: "Види тютюну для кальяну",
    description1:
      "Заправка для кальяну - це не чистий тютюновий лист. Як правило, кожен виробник використовує власні рецепти, використовує певну тютюнову сировину та ароматизатори. Умовно тютюн можна розділити на три категорії.",
    description2:
      "Муассель - суміш зі спеціально підготовленого тютюнового листа, ароматизатора, патоки та гліцерину. Крафтовий тютюн може містити різні натуральні наповнювачі або добавки. Це найпоширеніший вид, придбати який можна в будь-якому онлайн магазині. За основу муасселя беруть тютюновий лист:",
    listItems: {
      liItem1: "Virginia - класичний м'який з приємним м'яким смаком і легким присмаком, з мінімальним вмістом смол",
      liItem2: "Burley - тютюновий лист із підвищеною міцністю, чистим смаком, м'якою тягою, що не ріже горло",
      liItem3: "Муассель - це найпоширеніша тютюнова суміш, яка використовується і вдома, і в спеціалізованих закладах",
    },
    imgUrl: astiTabacco,
    conclusion1:
      "Томбак - це чисте тютюнове листя, яке пройшло спеціальну підготовку: нарізка, вимочування, сушка. Досить міцний, без ароматизаторів і добавок. Під час розкурювання такого кальяну відчувається його міцність ударом по горлу: він підійде винятково шанувальникам міцних покурів. Забивати томбак потрібно вимоченим і віджатим, ціле листя намотується на шахту і розігрівається вугіллям.",
    conclusion2:
      "Журак - це суміш муасселя і томбака. Дрібно нарізане тютюнове листя змішується з патокою, але не ароматизаторами. У результаті отримуємо середню міцність із приємним натуральним смаком. Забивання журака щільне, в чашу, вугілля укладається безпосередньо на масу.",
  },
  {
    header: "Популярні бренди тютюну для кальяну",
    description1:
      "Сьогодні практично в кожній країні виробляють тютюн для кальяну. Зарубіжні та вітчизняні українські виробники в умовах конкуренції дивують кальянщиків новими смаками і складами.",
    listItems: {
      liItem1:
        "SERBETLI - турецький тютюн середнього цінового сегмента, представлений у широкому асортимент. Бренд пропонує понад 200 смаків і свою особисту рецептуру - йогуртові мікси. Легкий, жаростійкий і в міру димний продукт.",
      liItem2:
        "BUTA - йорданський продукт, що випускається двома лінійками, легкий і міцний. Загалом виробник пропонує близько 40 смаків.",
      liItem3:
        "LIRRA - новий тютюн із Туреччини. Головним компонентом тютюнової продукції є лист сорту Вірджинія. Для отримання якісної продукції застосовуються натуральні якісні ароматизатори. ",
      liItem4:
        "CULTt - це кальянний тютюн німецької компанії Gulbahar. Продукт відмінно куриться, має довгограючий аромат. Смак розкривається дуже швидко.",
      liItem5:
        "MILANO - німецький тютюн преміум-класу. Головна перевага - легкість, що дозволяє використовувати тютюн як новачкам, так і досвідченим курцям. Неймовірна увага до деталей під час створення цього кальянного тютюну зробила тютюн воістину унікальним.",
      liItem6:
        "GIXOM - легкий турецький тютюн для кальяну. Виробник використовує якісні тютюнові листи, просочені натуральним медом. Сорт Virginia Gold часто береться за основу для отримання продукту середньої міцності.",
      liItem7:
        "4:20 - український продукт, який становить конкуренцію відомим закордонним брендам. Виробляється двома лінійками - кальянний тютюн або чайний лист в основі, доповнений якісними ароматизаторами.",
    },
  },
  {
    header: "Як вибрати тютюн?",
    description1:
      "Наш онлайн магазин тютюну для кальяну пропонує дуже великий вибір. Вибираючи суміш, варто враховувати деякі критерії:",
    listItems: {
      liItem1: "Міцність",
      liItem2: "Димність",
      liItem3: "Необхідність попередньої підготовки",
      liItem4: "Простота забивання",
      liItem5: "Склад",
      liItem6: "Смак",
    },
    imgUrl: skittlesTabacco,
    conclusion1:
      "Якщо Ви курець-початківець або хочете урізноманітнити свою колекцію тютюнових сумішей, наші консультанти завжди допоможуть зробити вибір, який задовольнить усі Ваші вимоги. Купуючи новий тютюн онлайн, прислухайтеся до порад щодо забивання: так Ви зможете розкрити смакові якості та отримати максимум задоволення від ароматного куріння. Ми гарантуємо якість реалізованої продукції: купуючи в нас, Ви можете розраховувати на швидке обслуговування, завжди свіжі продукти та приємні ціни.",
  },
  {
    header: "Переваги комфортних покупок тютюну для кальяну з VipKalyan",
    description1:
      "Тютюн для кальяну і чайні заправки до кальянів доступні майже скрізь, але багато хто усвідомлює, що в більшості місць продаються недорогі аналоги з невідомим хімічним складом, який може становити небезпеку для здоров'я людини! Наш інтернет-магазин кальянного тютюну Vipkalyan.com з продажем кальянного тютюну успішно працює вже багато років і має безліч позитивних відгуків, що підтверджують високу якість послуг, що надаються.",
    description2: " Чому варто вибрати саме нас для покупки тютюну для кальяну:",
    listItems: {
      liItem1: "Прийнятні ціни на весь асортимент.",
      liItem2: "Вигідні умови для оптових закупівель.",
      liItem3: "Накопичувальна система знижок та акцій для клієнтів.",
      liItem4: "Швидка доставка і надійне пакування товару.",
      liItem5: "Оплата при отриманні через послугу 'Нова Пошта'.",
      liItem6: "Пізнавальний кальянний блог на нашому сайті.",
    },
    conclusion1:
      "Замовити тютюн для кальяну можна онлайн, поклавши необхідні товари у віртуальний кошик. Вкажіть адресу доставки та контактний телефон, щоб наш співробітник міг зв'язатися з вами для уточнення інформації. Є питання? Телефонуйте нам за номером +38 (050) 844-95-00!",
  },
];
