import deliverFromNP from "../../imgs/delivery/dostavka-kurer.jpg";
import deliverSamovyvoz from "../../imgs/delivery/dostavka-samovivos.jpg";

const PaymentAndDelivery = () => {
  return (
    <>
      <h2 className="text-center mt-10 text-3xl font-medium">Оплата та доставка</h2>
      <h2 className="text-center mt-5 mb-5 text-2xl text-[1.4rem] font-medium ">Надсилання службою « Нова Пошта » </h2>

      <div className="grid grid-cols-[400px_1fr]">
        <div>
          <img src={deliverFromNP} alt="Доставка кур'єром" width={400} />
        </div>
        <div className="ml-5">
          <p>
            Доставка через транспортну компанію ТОВ «Нова Пошта» доступна для замовлень з інтернет-магазину VipKalyan до будь-якого
            населеного пункту України. Зазвичай термін доставки становить 1-2 дні відповідно до стандартів компанії-перевізника. Проте,
            для західної частини України, доставка може тривати 2 дні.
          </p>
          <h2 className="mt-5 mb-5 text-[1.4rem] font-medium">Термін доставлення Новою Поштою</h2>
          <p>
            Замовлення, розміщені до 17:30, будуть надіслані того ж дня, а якщо оформлення здійснюється після 17:30, то відправка буде
            здійснена наступного робочого дня. Важливо врахувати, що для надсилання замовлення цього ж дня оплату потрібно зробити до
            18:00
          </p>
          <h2 className="mt-5 mb-5 text-2xl text-[1.4rem] font-medium">Способи оплати доставки Новою Поштою</h2>
          <p>
            Для оплати у вас є два варіанти: "Податковий платіж" згідно з тарифами компанії ТОВ «Нова Пошта», оплата товару та послуги
            доставки буде здійснена після отримання товару в поштовому відділенні, або оплата замовлення на банківську картку.
            Реквізити для оплати будуть надані менеджером після підтвердження наявності товару у Вашому замовленні, зазвичай протягом
            години у робочий час.
          </p>
        </div>
      </div>
      <h2 className="mt-5 mb-5 text-2xl text-[1.4rem] font-medium text-center">Способи оплати доставки Новою Поштою</h2>
      <div className="grid grid-cols-[1000px_1fr]">
        <div>
          <h2 className="mt-5 mb-5 text-2xl text-[1.4rem] font-medium text-center">Способи оплати доставки Новою Поштою</h2>
          <p>
            Зверніть увагу, що мінімальна сума замовлення доставки по Україні складає 149 грн. Вартість доставки залежить від тарифів
            компанії та варіюється в залежності від відстані, ваги, обсягу замовлення та додаткових послуг.
          </p>
          <p className="mt-5 mb-5">
            Увага! Дорогі покупці, переконливе прохання, не забувайте, будь ласка, своїх замовлень у відділеннях ТК «Нова Пошта»
            (Термін зберігання 5 днів)
          </p>
          <p>
            Будь ласка, зверніть увагу, що важливо перевірити товар на предмет правильності при отриманні у відділенні пошти, та у разі
            будь-яких проблем, зв'яжіться з нами за телефоном +38(050)844-95-00. Подальші скарги та претензії не розглядатимуться.
          </p>
        </div>
        <div>
          <img src={deliverSamovyvoz} alt="Доставка самовивіз" width={400} />
        </div>
      </div>
    </>
  );
};

export default PaymentAndDelivery;
