import acherry_lemonade from "../../../../imgs/tabaks/420/250gr_darkLine/420_darkLine_250gr_cherry_lemonade.webp";
import peach_gelatto from "../../../../imgs/tabaks/420/250gr_darkLine/420_darkLine_250gr_peach_gelatto-.webp";

import type { CategoryDescription } from "../../../../types/data";

export const totalDescriptionPage420: CategoryDescription = [
  {
    header: "Тютюн для кальяну 420(Чотири Двадцять)",
    description1:
      "Тютюн 420(Чотири Двадцять) - результат праці українського виробника. Вітчизняний продукт був презентований 2018 року і вже зараз набув популярності серед українських любителів ароматно подиміти. Провокаційна назва продукту 420(Чотири Двадцять) насправді пояснюється дуже просто: це середня тривалість куріння правильно забитого кальяну. Якщо Ви шукаєте суміш преміум класу за приємною ціною - тютюн для кальяну 420(Чотири Двадцять) точно задовольнить Ваші запити. ",
  },
  {
    header: "Характеристики та особливості тютюну 420(Чотири Двадцять)",
    description1:
      "Український тютюн 420(Чотири Двадцять) цілком може конкурувати з більш дорогими зарубіжними кальянними сумішами. Виробник педантично ставиться до складу і процесу виробництва. В основі - тютюновий лист Burley і Virginia, а також якісні перевірені ароматизатори, що закуповуються в країнах Європи і в США. Сировина проходить вимочку і кілька етапів сушіння, зберігаючи свої найкращі курильні характеристики. Як результат - суміш має гарну димність і відмінну смакопередачу. Якщо ви шукаєте якісний український продукт з відмінною смакопередачею, димністю і доступною ціною - ознайомтеся з нашим докладним оглядом на кальянний тютюн 4:20. Чим привабливий тютюн для кальяну 420(Чотири Двадцять):",
    listItems: {
      liItem1:
        "Помірна міцність, що робить його практично універсальним. Він відмінно підійде і для курців-початківців, і кальянщиків зі стажем, які віддають перевагу м'яким сортам. ",
      liItem2:
        "Оптимальна жаростійкість і димність - результат правильної багатоетапної підготовки сировини. Тютюнові листи нарізаються, вимочуються і сушаться із суворим дотриманням технологічного процесу.",
      liItem3: "Чудово поєднується з іншими кальянними сумішами, що дає можливість створювати мікси на будь-який смак.",
      liItem4:
        "Висока жаростійкість - ще одна особливість 420(Чотири Двадцять). Ця марка не перегрівається і відмінно віддає смак і аромат протягом усього процесу куріння.",
      liItem5:
        "Димність, яку забезпечує кальянний тютюн 420(Чотири Двадцять), також отримує високу оцінку експертів. Густі ароматні клуби диму утворюються завдяки оптимальній концентрації соку і стійкості до жару. ",
    },
    conclusion1:
      "Тютюн 420(Чотири Двадцять) вирізняється чистотою: у суміші відсутні палички, листя, сміття, він не потребує попередньої підготовки, перебирати і віджимати не потрібно, він легко забивається і добре розподіляється. ",
    conclusion2:
      "Бренд впізнаваний завдяки своїй упаковці: продукт упакований у пластикову баночку з цікавим дизайном і герметичною кришкою. Після купівлі тютюну немає необхідності перекладати його: упаковка від виробника прекрасно тримає герметичність, забезпечує збереження смакових і курильних властивостей. ",
    imgUrl: acherry_lemonade,
  },
  {
    header: "ТОП-смаків тютюну 420(Чотири Двадцять)",
    description1:
      "Кальянний тютюн 420(Чотири Двадцять) представлений у широкому асортименті: вже сьогодні шанувальники бренду можуть насолоджуватися понад 50 ароматами, серед яких ягідні, фруктові та горіхові смаки. Кожен вид - це насичений вибух смаку, який повністю розкривається впродовж усього процесу куріння.",
    description2:
      "Асортимент бренду цілком здатний задовольнити найвимогливіших кальянщиків: дивовижний світ моносмаків і міксів - це можливість підібрати улюблений аромат - кислий, солодкий, пряний, освіжаючий. ",
    imgUrl: "",
  },
  {
    header: "Чайна суміш",
    description1:
      "Чайна суміш є ідеальним поєднанням смаків та ароматів. За допомогою високоякісних сортів чайного листа створюється запаморочлива суміш для кальяну. У неї насичений аромат і завдяки тому, що листя більш щільне, ніж тютюнове, смаком можна насолоджуватися набагато довше. На сьогоднішній день виробник пропонує величезний вибір ароматів, які можна розділити на такі категорії: фрукти, ягоди, десерти, коктейлі.",
  },
  {
    header: "Чому варто купити тютюн 4:20 в упаковці 40 грам?",
    description1:
      "Вибираючи тютюн для кальяну, варто спиратися не тільки на свої смакові переваги, а й на досвід. Тютюн 4:20 40 грам користується великим попитом завдяки зручному фасуванню і різноманітності смаків. З ним можна в будь-який час насолодитися вишуканим ароматом.",
    description2:
      "Висока якість і відповідність усім сучасним стандартам точно не залишать вас байдужими. Придбати упаковку 40 грам тютюну 4:20 можна в інтернет-магазині 'VipKalyan' за дуже вигідною доставкою і з оперативною доставкою. Вибравши тютюн 4:20, ви можете бути впевнені в інтенсивному смаку, густій хмарі диму і приємному курильному досвіді, який залишить вас задоволеним і задоволеним. Також на сайті представлений широкий вибір кальянів від відомих виробників. Продукція має високу якість і відповідає всім стандартам.",
    imgUrl: peach_gelatto,
  },
  {
    header: "Як правильно забивати",
    description1:
      "Тютюн 420(Чотири Двадцять) використовувати дуже просто. Він не потребує спеціальної підготовки, достатньо лише спушити його. Професіонали рекомендують забивати суміш не щільно в класичну чашу. Але пам'ятайте: якщо справа стосується куріння кальяну, завжди можна експериментувати, щоб отримати максимум задоволення.",
  },
  {
    header: "Де краще купити тютюн 420(Чотири Двадцять)",
    description1:
      "Тютюн 4:20 (Чотири Двадцять) - популярний український тютюн для кальяну, який поєднує преміальну якість і доступну ціну. У нас ви можете купити тютюн 420 з доставкою по Україні. Ми доставляємо тютюн 420 по всій Україні: Київ, Харків, Дніпро, Одеса, Львів та інші міста.",
    description2:
      "Купити тютюн 420(Чотири Двадцять) у нашому магазині онлайн - це зручно, швидко та вигідно. Ми пропонуємо великий вибір ароматів, гарантуємо якість і оригінальність продукції. Наші консультанти допоможуть визначитися з вибором і спростять процес оформлення замовлення. ",
  },
];
