import type { Brand, Product } from "../types/product";

import electronca from "../imgs/veipImg/odnorazki.webp";
import PODSystem from "../imgs/veipImg/pod-system.webp";
import other from "../imgs/veipImg/kartridze.webp";

import lostVapeUrsa from "../imgs/vapeGoodsList/kartridge_lost_vape_ursa_nano_v2_2.5ml_1.0om.webp";
import vooPooPnP_m2 from "../imgs/vapeGoodsList/isparitel_voopoo_pnp_m2_0.6_om.webp";
import smok_lp1 from "../imgs/vapeGoodsList/isparitel_smok_lp1_dc_0.8_om.webp";

import vape from "../../imgs/aboutGoods/vape.jpg";
import electronnaSygareta from "../../imgs/aboutGoods/electronnie-sigarety.jpg";

export const electroCygaretteTypeOfProductContent: Brand[] = [
  {
    id: "0",
    name: "Одноразові Електронні Сигарети",
    imgURL: electronca,
  },
  {
    id: "1",
    name: "Багаторазові POD Системи",
    imgURL: PODSystem,
  },
  {
    id: "2",
    name: "Комплектуючі",
    imgURL: other,
  },
];

export const electroCygaretteProductContent: Product[] = [
  {
    id: "0",
    brand: "Lost Vape",
    name: "Змінний Картридж Lost Vape Ursa Nano 2.5мл, 0.8 OM",
    description:
      "Електронні сигарети працюють на основі резервуарів, заповнених ароматизованою рідиною, тобто картриджів. Змінний Картридж Lost Vape Ursa Nano 2.5мл, 0.8 OM для електронних сигарет відомої марки. Кожен картридж POD-системи пропонує неперевершену якість, вироблену з використанням найсучасніших технологій. Змінний Картридж Lost Vape Ursa Nano 2.5мл, 0.8 OM формула забезпечує ідеальне поєднання інтенсивного смаку і гладкості, щоб кожна затяжка приносила максимальне задоволення. Зручні та легкі у використанні, ці картриджі ідеально підходять для повсякденного використання. Такий картридж для підсистеми виготовлений з високоякісного прозорого матеріалу, що дозволяє зручно контролювати рівень рідини. Завдяки зручній системі заправки ви можете швидко та без зайвих зусиль доливати рідину. Він ефективно контактує з електронною рідиною на сольовому нікотині та виробляє ідеальну пару. Пропонуємо тільки оригінальні моделі. Ідеальне рішення для шанувальників незабутнього вейпінгу.",
    imgURL: lostVapeUrsa,
    price: 115,
    having: true,
    about: {
      country: "Китай",
      cartridgeCapacity: "2.5 мл",
      cartridgeResistance: "0.8 Om",
      typeOfCoil: "Спіраль",
      cartridgeFixed: "Магнітне",
      cartridgeRefuilingType: "Бічна",
      color: "Чорний",
    },
  },
  {
    id: "1",
    brand: "VooPoo",
    name: "Змінний Випарювач VooPoo PnP-TM2 Mesh Coil 0.8 OM",
    description:
      "Змінний Випарник VooPoo PnP-TM2 Mesh Coil 0.8 OM - це високоякісний випаровувач, спеціально розроблений для використання з різними вейп-пристроями популярного бренду. POD-випарник створений із застосуванням передових технологій для забезпечення максимальної продуктивності. Наша унікальна конструкція гарантує надійність і довговічність, а спеціально розроблена формула матеріалів забезпечує чистий та інтенсивний смак під час кожного затягування. Він забезпечує гідну паропродуктивність, що дає змогу насолоджуватися приємним парінням та насиченим смаком вашої улюбленої рідини. Якісні комплектуючі упаковуються в герметичний пакет, щоб уникнути потрапляння пилу і сторонніх запахів. Змінний випаровувач VooPoo PnP-TM2 Mesh Coil 0.8 OM - ідеальне рішення для вейперів, які прагнуть найкращого смаку і щільних хмар пари.",
    imgURL: vooPooPnP_m2,
    price: 105,
    having: true,
    about: {
      country: "Китай",
      cartridgeCapacity: "2.5 мл",
      cartridgeResistance: "0.8 Om",
      typeOfCoil: "Спіраль",
    },
  },
  {
    id: "2",
    brand: "VooPoo",
    name: "Змінний Картридж VooPoo Argus 3мл, 1.0 ОМ",
    imgURL: smok_lp1,
    price: 135,
    having: true,
    about: {
      country: "Китай",
      cartridgeCapacity: "3 мл",
      cartridgeResistance: "1.0 Om",
      typeOfCoil: "Сітка",
      cartridgeFixed: "Магнітне",
      cartridgeRefuilingType: "Бічна",
      color: "Чорний",
    },
  },
];

export const electroCygaretteDescriptionContent = [
  {
    firstBlock: {
      header: "Що таке електронні сигарети",
      description1:
        "Електронна сигарета - це пристрій, який працює за рахунок енергії акумулятора, що імітує процес куріння завдяки випаровуванню рідини, виготовленої на основі сольового нікотину та інших речовин. Електронна сигарета створює відчуття вдихання тютюнового диму, хоча насправді відтворює густу щільну пару, що не завдає такої шкоди користувачеві, як традиційні сигарети. ",
      description2:
        "Популярність електронні сигарети здобули, бо достеменно імітують процес куріння тютюнових виробів, водночас у складі рідини може бути присутнім або відсутнім нікотин. Це допомагає курцям позбутися нікотинової залежності.",
      description3: "Кожен пристрій, незалежно від виду, складається з трьох основних частин:",
      listItems: {
        liItem1: "Акумулятора: механічного або класичного",
        liItem2: "Ємності для ароматичної рідини",
        liItem3: "Нагрівального елемента, що перетворює рідину на пару",
      },
      imgURL: vape,
      conclusion1:
        "Уперше електронні сигарети були представлені на китайському ринку. Сьогодні вони набули величезного поширення по всьому світу. Їх можна придбати в будь-якому магазині тютюнових виробів, а також у нашому інтернет магазині за ціною з мінімальними націнками.",
    },
    secondBlock: {
      header: "Які бувають види і типи електронок",
      description1: "Купити електронку недорого можна вибравши з представленого асортименту, спираючись на її призначення:",
      listItems: {
        liItem1:
          "Боксмод - комплект для паріння, що складається з атомайзера та елемента живлення. Електронний пристрій дає змогу змінювати картриджі або створити для себе унікальну рідину. Відрізняється громіздкістю, важкою вагою і виступаючим баком з верхньої частини корпусу.  ",
        liItem2:
          "Pod-системи - компактні моделі, що мають вигляд плоскої ручки або невеликої трубки, яка зручно лежить у руці. Картридж для рідини одночасно виступає в ролі резервуара і випарника.  ",
        liItem3:
          "Одноразовий вейп - це електронки з монолітним корпусом, що не дає змоги замінити використану ємність для рідини або заповнити її знову. Їх не можна зарядити, тому акумулятор розрахований на певну кількість затяжок і не більше.",
      },
      conclusion1:
        "Крім призначення, електронні сигарети можуть відрізнятися за типом затяжки. Сигаретний вейп практично нічим не відрізняється від тютюнової сигарети, характеризуються малою кількістю пари, тугою тягою і ударом по горлу. Кальянна електронна сигарета вирізняється відмінною передачею смаку, утворенням рясної пари та відсутністю 'удару' по горлу. ",
      conclusion2:
        "Також електронні сигарети діляться на такі, що обслуговуються, - потребують заміни вати і нагрівального елементу в атомайзері, заповнення рідини, і такі, що не обслуговуються. Ці види пристроїв не потребують догляду, достатньо купити картридж і атомайзер і замінити використані.",
    },
    thirdBlock: {
      header: "Переваги електронних сигарет (вейпів)",
      description1: "Електронна сигарета не втрачає позицій у популярності завдяки таким перевагам:",
      listItems: {
        liItem1:
          "Відсутність смол і самого процесу згоряння тютюнового листя, що виділяє безліч шкідливих речовин, робить вейпи безпечнішими для користувача;пристрій допомагає відмовитися від шкідливої звички курити",
        liItem2: "Різноманітність смаків дає змогу розширити смакові враження",
        liItem3:
          "Міцність вейпів має великий вибір градацій, тому кожен підбере для себе відповідний продукт: від міцного до нульовки",
        liItem4:
          "Вейпи можна використовувати практично скрізь без обмежень, тому що немає неприємного запаху і шкоди від випаровування рідини",
        liItem5:
          "Користувач забуде про попільнички і запальнички, а також про пожовклі зуби, які є постійними супутниками курців тютюну",
        liItem6: "Можливість багаторазового використання електронних сигарет дає змогу економити гроші",
      },
      imgURL: electronnaSygareta,
      conclusion1:
        "Якщо замовити вейп, то є можливість знайти однодумців і потрапити до спільноти вейперів. Це також є плюсом для активних і товариських людей, які шукають нові враження.",
    },
    fourthBlock: {
      header: "Як підібрати електронну сигарету",
      description1:
        "Багато хто під час вибору девайса спирається на судження: що дорожче, то краще. Однак з електронними сигаретами цей підхід не спрацює. Необхідно спиратися на характеристику продукції, її виробника і цільовий фактор. ",
      description2: "До характерних особливостей електронних сигарет можна віднести:",
      listItems: {
        liItem1:
          "Розміри та вагу корпусу. Для щоденного і частого використання краще вибрати компактні під-системи, які зручно носити в кишені.",
        liItem2:
          "Обсяг ємності для рідини. Цей показник буде говорити про кількість можливих затяжок. У нашому інтернет-магазині можна замовити вейп онлайн розрахований від 300 до понад 2000 затяжок.",
        liItem3:
          "Ємність акумулятора. Цей показник вимірюється в міліампер-годинах. Чим більше значення, тим більше часу девайс працюватиме автономно.",
        liItem4: "Сучасні електронки можуть протримати заряд близько дня залежно від частоти використання.",
        liItem5:
          "Тип управління. Девайс можна активізувати за допомогою кнопки 'Пуск' або з першої затяжки. Також конструкція може передбачати регулювання потужності та вид тяги.",
        liItem6:
          "Можливість багаторазового та одноразового використання. Для тих, хто не хоче міняти картриджі або заправляти ємність, краще вибрати одноразові під-системи.",
      },
      conclusion1:
        "Якщо вибирати виробника, то найбільш популярними вважаються Elf Bar і Vaal, які можна купити в нашому інтернет-магазині.      ",
    },
    fiveBlock: {
      header: "Вибір марки електронних сигарет для покупки",
      description1:
        "Електронні сигарети пропонують різноманітність моделей і характеристик, завдяки чому кожен може вибрати пристрій під свої переваги. Ось деякі з найбільш відомих брендів, які користуються популярністю серед користувачів:",
      description2: "До характерних особливостей електронних сигарет можна віднести:",
      listItems: {
        liItem1:
          "VAAL - відомий бренд, що пропонує одноразові електронні сигарети з високою ємністю батареї та різноманітністю смаків.",
        liItem2: "Elf Bar - бренд одноразових пристроїв, що пропонує довгий термін служби і насичені смаки.",
        liItem3: "Vaporesso - виробник, що спеціалізується на високоякісних вейпах з функціями регулювання потужності.",
        liItem4: "SMOK - один із лідерів на ринку, що пропонує широкий асортимент пристроїв від компактних вейпів до потужних модів.",
        liItem5: "Моті- бренд, відомий своєю міцністю і надійністю, особливо популярний серед досвідчених користувачів.",
        liItem6:
          "VooPoo- бренд із різноманітними моделями вейпів, зокрема компактними пристроями для початківців і складнішими моделями для досвідчених користувачів.",
        liItem7:
          "Uwell - бренд, що пропонує широкий асортимент ароматів і надійну якість, популярний як серед новачків, так і серед досвідчених вейперів.",
      },
      conclusion1:
        "Кожен із цих брендів пропонує унікальні особливості та різноманітність смаків, даючи змогу підібрати пристрій для паріння під будь-який стиль і вподобання.",
    },
    sixBlock: {
      header: "Вартість електро сигарет",
      description1:
        "Середньостатистичний курець може викурити від 20 цигарок на добу, витрачаючи щомісяця гроші, які можна порівняти з купівлею багаторазової електронки та рідини, запасу якої вистачить на рік. Тому електронна сигарета дасть змогу заощадити. ",
      description2:
        "Ціна девайса залежить від безлічі факторів, починаючи від 250 грн. за одноразовий пристрій. Найдорожчі пристрої - це мод блоки і комплекти, багаторазове використання яких виправдовує таку вартість. Стильні, багатофункціональні та високопродуктивні вейпи також вийдуть дорожче порівняно з простими моделями.  ",
    },
    sevenBlock: {
      header: "Як замовити електронку",
      description1:
        "Замовити електронну сигарету в нашому онлайн-магазині можливо через кошик покупок, заповнивши невелику форму замовлення. Також можна скористатися допомогою менеджера, який надасть консультацію у виборі підходящого девайса і оформить покупку в телефонному режимі.",
      description2:
        "Ми пропонуємо тільки оригінальний товар від світових брендів, велике розмаїття асортименту, який завжди в наявності, і доступні ціни. Доставка здійснюється транспортними службами по всій Україні. Оплатити замовлення можливо переказом на реквізити або при отриманні післяплатою.",
    },
  },
];
