import type { Brand } from "../types/product";
import type { ContentBlock } from "../types/data";
import type { HookahProduct } from "../types/product";

import hookahBrandAMY from "../imgs/hookahs/hookahBrands/amy_deluxe_logo.webp";
import hookahBrandEmbery from "../imgs/hookahs/hookahBrands/embery_logo.webp";
import hookahBrand2x2 from "../imgs/hookahs/hookahBrands/2x2_logo.webp";
import hookahBrandKarma from "../imgs/hookahs/hookahBrands/karma_logo.webp";
import hookahBrandLuna from "../imgs/hookahs/hookahBrands/luna_logo.webp";

import hookahAmyDeluxe_072_02Black from "../imgs/hookahs/hookahsFoto/amy_deluxe_072_02_bk.webp";
import hookahKarmaClassic_1_2White from "../imgs/hookahs/hookahsFoto/amy_deluxe_072_02_bk.webp";

export const hookahsTypeOfProductContent: Brand[] = [
  {
    id: "0",
    name: "Кальяни AMY",
    imgURL: hookahBrandAMY,
  },
  {
    id: "1",
    name: "Кальяни Embery",
    imgURL: hookahBrandEmbery,
  },
  {
    id: "2",
    name: "Кальяни Hookah 2x2",
    imgURL: hookahBrand2x2,
  },
  {
    id: "3",
    name: "Кальяни Karma",
    imgURL: hookahBrandKarma,
  },
  {
    id: "4",
    name: "Кальяни Luna",
    imgURL: hookahBrandLuna,
  },
];

export const hookahProductContent: HookahProduct[] = [
  {
    id: "0",
    name: " Кальян Alu Antique Berry S 072.02 BK (Чорний)",
    imgUrl: hookahAmyDeluxe_072_02Black,
    description: {
      header1: "Опис кальяну Amy",
      textUnderHeader1:
        "Стильний і функціональний Кальян Amy Deluxe Alu Antique Berry S 072.02 BK (Чорний) - чудовий вибір для оснащення мобільної кальянної. Невеликі розміри, висока якість комплектуючих, зручність експлуатації дає змогу створити умови для комфортабельного куріння кальяну як вдома, так і під час поїздки на природу. ",
      secondTextUnderHeader2:
        "Кальян Amy Deluxe Alu Antique Berry S 072.02 BK (Чорний) виробляється згідно з високими стандартами німецького виробника. Бюджетна лінійка продукції бренду ввібрала в себе кращі традиції виробництва, при доступній ціні. Привертає увагу і бездоганний дизайн. Всі його елементи детально опрацьовані, а якість відчувається з першого дотику.",
      header2: "Комплектація",
      textUnderHeader2:
        "Німецький виробник створив якісний продукт, придбати який можна за приємною ціною. Ви отримуєте все необхідне, для куріння з першого дня його покупки. Складається кальян з: ",
      liItem1: "Скляної колби",
      liItem2: "шахти з хромованої сталі",
      liItem3: "Трубки",
      liItem4: "Конектора під чашу",
      liItem5: "Глиняної чаші",
      liItem6: "Мундштук ",
      liItem7: "Силіконовий шланг",
      conclusion1:
        "Висота всього приладу - 45 см, а місткість колби - 1л. Порт для підключення шланга один. Для великої компанії варто придбати індивідуальні змінні мундштуки. Конструкція передбачає стійке дно колби. Ви можете взяти його з собою в поїздку, встановити в будинку або квартирі. Щоб приступити до паління відразу після покупки, не забудьте замовити кальянне вугілля.",
      header3: "Кальян офіційного виробництва",
      textUnderHeader3:
        "При замовленні оригінального виробу, ви отримуєте кальян Кальян Amy Deluxe Alu Antique Berry S 072.02 BK (Чорний) у фірмовій коробці. Він стане чудовим придбанням для себе, або як подарунок. Його зможе зібрати і використовувати навіть новачок, який тільки пізнає кальянне мистецтво.",
      secondTextUnderHeader3:
        "Кальян передбачає створення густих клубів пари, які приємно вдихати. Однак важливо придбати і якісний тютюн для кальяну. Ви можете оформити замовлення на сайті, і отримати все необхідне в одній покупці.",
      contactWithUs: "Якщо у вас залишилися питання, ви завжди можете їх задати нам за номером телефону +38(050)844-95-00.",
    },
    price: 3000,
    having: true,
    about: {
      brand: "Amy",
      heighWithoutBowl: 45,
      typeOfConnection: "Click-Система",
      meterial: "Анодований Алюміній",
      diameterOfMine: 1.2,
      numberOfPortsUnderTheHose: 1,
      colorOfColb: "Чорний",
      colorOfMine: "Чорний",
      hookahMineDiffuser: "Немає",
      oilCollector: "Немає",
      volumeColb: 1,
      country: "Німеччина",
    },
  },
  {
    id: "1",
    name: " Кальян Модель 1.2 Classic White (Білий)",
    imgUrl: hookahKarmaClassic_1_2White,
    description: {
      header1: "Опис кальяну Karma Hookah",
      textUnderHeader1:
        "Karma Hookah - український бренд, що створює якісну продукцію, яка отримала визнання як на внутрішньому, так і на міжнародному ринку. Вони змогли довести, що українські кальяни, не поступаються за якістю німецьким, арабським, американським.",
      secondTextUnderHeader2:
        "Стильний Кальян Karma Hookah Модель 1.2 Classic White (Білий) виготовлений згідно з високими стандартами. Національний бренд перейняв досвід кращих зарубіжних компаній і вдосконалив підхід до виробництва. Кожен етап створення кальяну педантично контролюється, а можливі недоліки усуваються до випуску готового виробу. Це зводить на 'ні' можливість отримання споживачем неякісного продукту.",
      header2: "Переваги стильного кальяну Karma Hookah",
      textUnderHeader2: "Яскравий Кальян Karma Hookah Модель 1.2 Classic White (Білий) має комплекс переваг:",
      liItem1:
        "Якість кожного компонента. Основні матеріали виготовлення - нержавіюча сталь і натуральне дерево. Це робить його зносостійким і дозволяє створити сприятливі умови для тривалого і якісного куріння. ",
      liItem2:
        "Компактний розмір, що дозволяє комфортно використовувати пристрій вдома. Його просто розбирати і збирати, чистити, використовувати. З цим впорається навіть користувач без жодного досвіду.",
      liItem3: "Стильний дизайн. Кожна деталь продумана до дрібниць. ",
      conclusion1: "Купуючи стильний кальян українського виробництва, не забудьте замовити кальянне вугілля.",
      header3: "Елегантний дизайн",
      textUnderHeader3:
        "Бренд продумав дизайн лінійки до дрібниць. Ви отримуєте витвір мистецтва, замість звичайного домашнього кальяну. Основа під чашу у вигляді різьбленої квітки, шахта з дерев'яних елементів, прикрашений деревом мундштук. Все це виводить невеликий домашній кальян на зовсім інший рівень якості. ",
      secondTextUnderHeader3:
        "Вражаючий зовнішній вигляд створює особливу атмосферу. Класичний продукт з тисячолітньою історією отримав інноваційний дизайн. Щоб оснастити ексклюзивний кальян гідними розхідниками, замовте на сайті оригінальний тютюн для кальяну. ",
      contactWithUs: "Якщо у вас залишилися питання, ви завжди можете їх задати нам за номером телефону +38(050)844-95-00.",
    },
    price: 7779,
    having: true,
    saucer: {
      firstType: "Classic",
      secondType: "Brazilian",
      thirdType: "Feather",
      fourthType: "Flora",
    },
    about: {
      brand: "Karma",
      heighWithoutBowl: 61,
      typeOfConnection: "Ущільнювач",
      meterial: "Нержавіюча Сталь",
      diameterOfMine: 1.1,
      numberOfPortsUnderTheHose: 1,
      colorOfColb: "Чорний",
      colorOfMine: "Білий",
      hookahMineDiffuser: "Немає",
      oilCollector: "Немає",
      typeOfSaucer: "На Вибір",
      volumeColb: 2,
      bowlIsAvailable: "Так",
      country: "Україна",
    },
  },
];

export const hookahDescriptionContent: ContentBlock[] = [
  {
    header: "Кальяни: традиції, вибір і переваги покупки з VipKalyan",
    description1:
      "Куріння кальяну - улюблений ритуал, що прийшов до нас зі Сходу кілька десятків років тому. З давніх-давен за курінням обговорювали важливі справи, розслаблялися після важкого дня і просто відпочивали. Сьогодні він став настільки поширеним, що перетворився на справжнісіньке хобі для людей різного віку.",
    description2:
      "Нині замовити кальян можна, прийшовши в кафе, ресторан або в бар. Однак, якщо ви віддаєте перевагу насолоджуватися ним щодня і не хочете переплачувати, то можете купити його для особистого використання і насолоджуватися його курінням де завгодно: на природі, вдома або в поїздках.",
    description3:
      "Наш інтернет-магазин займається продажем кальянів протягом багатьох років і завдяки нам ви зможете придбати виріб оптимальних розмірів для найбільш комфортного використання.",
    imgUrl: hookahAmyDeluxe_072_02Black,
  },
  {
    header: "Різновиди кальянів",
    description1:
      "Сьогодні в Україні можна купити в найширшому асортименті моделей. В першу чергу один від одного вони відрізняються за своїми габаритами. У продажу представлені вироби висотою від 30 і аж до 80 сантиметрів. Найбільш популярні моделі висотою 40-50 сантиметрів, а також 70-80 сантиметрів.",
    description2:
      "Крім цього, вони розрізняються за кількістю трубок - їх може бути 2, 4 або 5. Залежно від того, наскільки великою компанією ви можете вибрати найбільш підходящу модель для комфортного куріння.",
    description3:
      "Не можна не згадати і про дизайн. У продажу представлені як вироби традиційного східного дизайну з різними авторськими розписами, так і сучасні рішення. Сучасні вироби можуть відрізнятися іншим розташуванням деяких елементів, водночас принцип роботи практично повністю ідентичний.",
  },
  {
    header: "Чому кальян користується популярністю в Україні?",
    description1:
      "Кальян - це традиційний східний пристрій для куріння, який користується високою популярністю в Україні. Одна з основних причин цієї популярності полягає в культурних зв'язках між Україною та країнами Близького Сходу, де кальян має довгу і багату історію. Кальян також популярний серед молоді, оскільки це соціальна розвага, що дає змогу проводити час із друзями або сім'єю в затишній атмосфері кальяну клубів або кафе. Крім того, багато людей знаходять задоволення в різноманітних ароматах і смаках тютюну, який використовується в ньому, і вважають його м'якшим і менш шкідливим альтернативним способом куріння.",
    description2:
      "В Україні також розвинена культура кальянного ремесла, і багато майстрів створюють унікальні і красиві кальяни, які стають предметами колекціонування і прикрасою інтер'єру. Усі ці фактори разом роблять його популярною і затребуваною розвагою серед населення України.",
  },
  {
    header: "Як правильно вибрати кальян?",
    description1: "Вибір кальяну - важливий етап, який вимагає уваги і знання основних аспектів:",
    listItems: {
      liItem1:
        "Необхідно визначитися з розміром, виходячи з уподобань і потреб. Великі - можуть мати більш інтенсивне куріння і володіти вражаючим зовнішнім виглядом, в той час як маленькі - більш компактні і мобільні.",
      liItem2:
        "Слід звернути увагу на матеріал, з якого він зроблений. Оптимальними варіантами вважаються нержавіюча сталь, латунь або мідь, оскільки вони довговічні та не впливають на смак куріння.",
      liItem3: "Важливо вибрати правильну форму фужера і шахти, оскільки це може впливати на тягу і смак кальяну.",
      liItem4:
        "Варто звернути увагу на наявність додаткових опцій, таких як система рівнів води або регульована система дихання, які можуть поліпшити якість куріння.",
    },
    conclusion1:
      "І, нарешті, не забудьте про тютюн і аксесуари, як-от вугілля, фольга і сітка, які також важливі для правильного і комфортного куріння кальяну.",
  },

  {
    header: "Звертаємо Вашу увагу на кращі бренди кальянів",
    description1:
      "Кожен бренд має свої переваги і заслуговує окремої уваги. За кожним стоїть величезна історія створення, злети і падіння, помилки і непередбачений успіх. Але деякі з них заслуговують особливої уваги та розгляду ближче. У нашому магазині представлено все необхідне для куріння кальяну. Ми пропонуємо виключно перевірені світові бренди, які визнані найкращими на ринку. Ось лише кілька з них:",
    listItems: {
      liItem1:
        "AMY Deluxe - німецька компанія, один з лідерів ринку. Їхні кальяни відзначаються високою якістю, широким асортиментом і доступними цінами, що робить їх привабливими для кожного курця.",
      liItem2:
        "Karma Hookah - це втілення елегантності і якості в світі кальянного мистецтва. Ми є офіційним дистриб'ютором кальянів Karma і гарантуємо дійсність кожного продукту. Це перший український бренд кальянів з використанням дерева, компактна і практична модель, яка сподобається кожному любителю кальянного відпочинку.",
    },
    imgUrl: hookahKarmaClassic_1_2White,
    conclusion1:
      "Кожен рік виробники створюють все кращі та надійніші товари для своїх покупців. Поєднуючи надійність і якість з доступною ціною, ми отримуємо найкращий товар, який може собі дозволити кожен. У нашому каталозі також представлено безліч інших виробників, кожен з яких має свої переваги. Якщо ви маєте сумніви щодо вибору, наші фахівці завжди готові допомогти вам зробити правильний вибір.",
  },
  {
    header: "Переваги комфортних покупок тютюну для кальяну з VipKalyan",
    description1:
      "Vipkalyan.com успішно працює з продажу тютюну для кальяну вже багато років і має безліч позитивних відгуків, що підтверджують високу якість послуг, що надаються.",
    listItems: {
      liItem1: "Перевага покупки кальянів в інтернет магазині ВіпКальян",
      liItem2: "Прийнятні ціни на весь асортимент.",
      liItem3: "Вигідні умови для оптових закупівель.",
      liItem4: "Накопичувальна система знижок та акцій для клієнтів.",
      liItem5: "Швидка доставка і надійне пакування товару.",
      liItem6: "Оплата при отриманні через послугу 'Нова Пошта'.",
      liItem7: "Пізнавальний кальянний блог на нашому сайті.",
    },
    conclusion1:
      "Замовити та купити кальян можна онлайн с доставкою, поклавши необхідні товари у віртуальний кошик. Вкажіть адресу доставки та контактний телефон, щоб наш співробітник міг зв'язатися з вами для уточнення інформації. Є питання? Телефонуйте нам за номером +38 (050) 844-95-00!",
  },
];
