import type { Brand, Product } from "../types/product";
import type { ContentBlock } from "../types/data";

import saltLiquid from "../imgs/liquids/liquidsBrand/salt-zhidkost.webp";
import setForLuquid from "../imgs/liquids/liquidsBrand/zames-zhidkost.webp";
import alchimstRichApple from "../imgs/liquids/liquidsImg/alchemist_10ml_rich_apple.webp";
import alchimstGrapefruit from "../imgs/liquids/liquidsImg/alchemist_10ml_grapefruit.webp";
import liquidAnotherFoto from "../imgs/liquids/liquidsOtherFoto/zhidkosti.jpg";
import liquidAnotherFoto2 from "../imgs/liquids/liquidsOtherFoto/zhidkosti_1.jpg";

export const liquidsTypeOfProductContent: Brand[] = [
  {
    id: "0",
    name: "Сольові рідини для POD-систем",
    imgURL: saltLiquid,
  },
  {
    id: "1",
    name: "Набори для самозамісу",
    imgURL: setForLuquid,
  },
];

export const liquidsProductContent: Product[] = [
  {
    id: "0",
    brand: "Alchemist",
    name: " Рідина на сольовому нікотині Rich Apple (Багате Яблуко) 10 мл",
    levelOfNicotine1: "35 мг/мл",
    levelOfNicotine2: "50 мг/мл",
    description: {
      header1: "Опис рідини",
      textUnderHeader1:
        "Рідина на сольовому нікотині Alchemist Rich Apple (Багате Яблуко) 10 мл стане відмінним вибором для самостійного обслуговування під систем. Насичені за смаком склади педантично розроблені і створені з урахуванням високих стандартів якості. Ви відчуєте багатий букет в кожній затяжці.",
      header2: "Переваги складу ",
      textUnderHeader2: "Серед переваг оригінальної рідини варто відзначити:",
      liItem1: "Якісний склад включає в себе натуральні компоненти, які безпечні для людини.",
      liItem2: "Зручність експлуатації. Баночки враховують особливості процесу заправки, і розроблені для його спрощення.",
      liItem3:
        "Оптимальне співвідношення гліцерину і пропіленгліколю 50/50 уможливлює застосування на будь-яких підсистемах і вейпах.",
      conclusion1:
        "Щоб рідина максимально розкривала свої смаки при кожній заправці, необхідно правильно зберігати її. Не допускайте потрапляння прямих сонячних променів, вологи, не залишайте колбу відкритою.",
      conclusion2:
        "Рідина на сольовому нікотині Alchemist Rich Apple (Багате Яблуко) 10 мл - преміальний продукт для досвідчених вейперів і новачків. Вона забезпечить високу димність, стійкий аромат і малий удар по горлу. Щоб замовити офіційний продукт, оформіть покупку на сайті або зв'яжіться з менеджером компанії.",
      contactWithUs: "Якщо у вас залишилися питання, ви завжди можете їх задати нам за номером телефону +38(050)844-95-00.",
    },

    imgUrl: alchimstRichApple,
    price: 145,
    having: true,
    about: {
      country: "Ізраїль",
      volume: 10,
      VGPG: "50/50",
      toughOfNicotine: "35 / 50",
      typeOfNicotine: "Сольовий",
      taste: "Червоне Яблуко",
      fresh: 0,
      spice: 0,
      sour: 1,
      sweet: 3,
    },
  },
  {
    id: "1",
    brand: "Alchemist",
    name: " Рідина на сольовому нікотині Grapefruit (Грейпфрут) 10 мл",
    levelOfNicotine1: "35 мг/мл",
    levelOfNicotine2: "50 мг/мл",
    description: {
      header1: "Опис рідини",
      textUnderHeader1:
        "Рідина на сольовому нікотині Alchemist Grapefruit (Грейпфрут) 10 мл стане відмінним вибором для самостійного обслуговування під систем. Насичені за смаком склади педантично розроблені і створені з урахуванням високих стандартів якості. Ви відчуєте багатий букет в кожній затяжці.",
      header2: "Переваги складу ",
      textUnderHeader2: "Серед переваг оригінальної рідини варто відзначити:",
      liItem1: "Якісний склад включає в себе натуральні компоненти, які безпечні для людини.",
      liItem2: "Зручність експлуатації. Баночки враховують особливості процесу заправки, і розроблені для його спрощення.",
      liItem3:
        "Оптимальне співвідношення гліцерину і пропіленгліколю 50/50 уможливлює застосування на будь-яких підсистемах і вейпах.",
      conclusion1:
        "Щоб рідина максимально розкривала свої смаки при кожній заправці, необхідно правильно зберігати її. Не допускайте потрапляння прямих сонячних променів, вологи, не залишайте колбу відкритою.",
      conclusion2:
        "Рідина на сольовому нікотині Alchemist Grapefruit (Грейпфрут) 10 мл - преміальний продукт для досвідчених вейперів і новачків. Вона забезпечить високу димність, стійкий аромат і малий удар по горлу. Щоб замовити офіційний продукт, оформіть покупку на сайті або зв'яжіться з менеджером компанії.",
      contactWithUs: "Якщо у вас залишилися питання, ви завжди можете їх задати нам за номером телефону +38(050)844-95-00.",
    },

    imgUrl: alchimstGrapefruit,
    price: 145,
    having: true,
    about: {
      country: "Ізраїль",
      volume: 10,
      VGPG: "50/50",
      toughOfNicotine: "35 / 50",
      typeOfNicotine: "Сольовий",
      taste: "Грейпфрут",
      fresh: 0,
      spice: 0,
      sour: 3,
      sweet: 1,
    },
  },
];

export const liquidDescriptionContent: ContentBlock[] = [
  {
    header: "Склад рідини для електронних сигарет",
    description1:
      "Електронні сигарети або вейп міцно зайняли свої позиції на ринку. Багато курців почитали чим вони відрізняються від звичайних сигарет і прийняли правильне рішення на користь електронних. Основою є рідина для електронних сигарет. Вона менш шкідлива для організму людини, оскільки не містить смол та інших продуктів горіння. Найменшої шкоди завдають безнікотинові варіанти. Вони широко поширені серед колишніх завзятих курців, які методом поступового зниження рівня нікотину позбулися такої залежності назавжди.",
    description2:
      "Рідини для електронних сигарет утворюють пар, схожий на смак диму. Процес утворення відбувається всередині пристрою. Виробники пропонують різні смаки, одержувані завдяки наповнювачам. Здебільшого використовуються натуральні, але вони дорожчі за ціною. Від якості та можливості багаторазового використання безпосередньо залежить вартість товару. Якщо купувати у перевірених виробників, то можна дійсно отримувати задоволення від процесу і не переживати про своє здоров'я.",
    description3: "Рідина для електронок у своєму складі має:",
    listItems: {
      liItem1: "Гліцерин",
      liItem2: "Пропіленгліколь",
      liItem3: "Добавки",
      liItem4: "Ароматизатори",
      liItem5: "Нікотин (якщо продукція передбачає його вміст)",
    },
    imgUrl: liquidAnotherFoto,
    conclusion1:
      "Від концентрації компонентів залежить смак. Що вища концентрація ароматизатора, то яскравішим і насиченішим стає процес паріння. Для отримання ідеального продукту виробники постійно експериментують і надають таку можливість споживачеві. Складові компоненти абсолютно нешкідливі і часто зустрічаються у звичайному житті: кулінарія, фармацевтика тощо. А купувати пристрої з нікотином у складі зовсім необов'язково. Але для любителів він надає міцності продукту. Це справа смаку кожного. Виробник надає право вибору людині, але рекомендує не завдавати шкоди здоров'ю.",
    conclusion2:
      "Хороша рідина для електронок не може бути дешевою, але виробники знайшли способи зниження ціни. Шляхом нескладних підрахунків кожен може переконатися, що купувати її вигідніше, ніж звичайні сигарети. З огляду на те, що кількість затягувань ви регулюєте самостійно, це може стати чудовим способом економії грошей і збереження здоров'я.",
  },
  {
    header: "Характеристики рідини для POD системи",
    description1:
      "Смакові якості POD-системи залежать від міцності нікотину і відсоткового вмісту гліцерину і пропіленгліколю (PG/VG). Рідина для вейпа готується в спеціальних умовах з дотриманням технологічних вимог. Від співвідношення складових залежить густота пари. Її щільність - суто індивідуальна перевага і залежить від кількості гліцерину. Він не впливає на смакові якості, а потрібен для створення димності. Визначте для себе що саме вам подобається більше. У разі виникнення будь-яких запитань краще відразу проконсультуватися з досвідченим вейпером або консультантом компанії, де ви плануєте зробити покупку. Рідина для вейпа повинна купуватися виключно у перевірених продавців. Не шукайте на ринку підробки - вони небезпечні.",
    description2: "Найпопулярнішими співвідношеннями PG/VG є:",
    listItems: {
      liItem1: "50/50",
      liItem2: "70/30",
    },
    conclusion1:
      "Зі звичайним нікотином вони становлять 50/50, а з сольовим часто зустрічаються 60/40. Від особливостей вашого сприйняття нікотину залежить вибір його концентрації. Якщо ви завзятий курець, то можна легко позбутися цієї згубної звички. Просто знижуйте поступово рівень вмісту нікотину у своїй рідині для електронних сигарет до повної відмови від нікотинових варіантів.",
  },
  {
    header: "Міцність, смак і вміст нікотину: як вибрати",
    description1:
      "Припустимо, ви курите пачку звичайних сигарет на день. Щоб замінити її на електронний варіант, потрібно зрозуміти, яка кількість нікотину вам необхідна для задоволення денної потреби. Адже залежить ще від того, що ви курите: стандартні або полегшені сигарети, де, до речі, теж вказується кількість нікотину. Підберіть для себе варіант із приблизно такими ж характеристиками. На перших порах, можливо, знадобиться більша кількість нікотину, щоб поступово звикнути до електронного сигарети і перейти на неї.",
    description2:
      "Купуйте рідину для електронних сигарет з улюбленим смаком. Він створюється шляхом додавання ароматизаторів. Вони нешкідливі і часто ви їх вживаєте разом із їжею, якщо не дотримуєтеся суворої дієти та певних вимог. На смак міцність нікотину практично не впливає. Але якщо вам подобається грубий тютюновий присмак, то від, наприклад, полуничних ароматів варто відсторонитися. Хоча дехто пробує фруктові варіанти (а їх дуже багато) і отримує задоволення від незвичайних поєднань. Спробуйте, може, сподобається.",
  },
  {
    header: "Виробники та марки рідини для паріння",
    description1:
      "Ринок електронних рідин для вейпа пропонує величезне розмаїття смаків і марок, що задовольняють найрізноманітніші уподобання. Незалежно від того, чи є ви новачком у вейпінгу або досвідченим користувачем, ви зможете знайти рідину, яка зробить ваш досвід паріння максимально приємним.",
    description2:
      "У нашому каталозі ви знайдете рідини для електронних сигарет від відомих українських і зарубіжних виробників. Кожна марка має свої унікальні особливості та пропонує широкий вибір смаків.",
    listItems: {
      liItem1:
        "420 Liquid. 420 Liquid відомий своїми насиченими і глибокими ароматами. Це чудовий вибір для тих, хто віддає перевагу інтенсивним і виразним смакам.",
      liItem2:
        "ElfLiq. Рідини для вейпа від Elf Liq включають різноманітні фруктові та десертні аромати. Продукція цього бренду вирізняється високою якістю та ідеально підходить для щоденного використання.",
      liItem3:
        "BeVape. Сольова рідина BeVape славиться своїми унікальними смаковими комбінаціями, що робить її чудовим вибором для тих, хто любить експериментувати з новими смаками.",
      liItem4:
        "Chaser. Chaser salt пропонує рідини з підвищеною міцністю і глибиною смаку. Це чудовий вибір для вейперів, які шукають насичені та стійкі аромати.",
      liItem5:
        "Hype. Сольові рідини від Hype виділяються своїми свіжими і легкими смаками, що ідеально підходять для літнього періоду. Ці рідини відомі своєю м'якістю і чистотою смаку.",
      liItem6:
        "Nectar. Заправки для електронних сигарет Nectar спеціалізуються на складних фруктових і ягідних міксах, що дивують своєю багатогранністю і насиченістю.",
      liItem7: "Twisted. Twisted відомий своїми складними десертними та напоєвими смаками, які точно відтворюють оригінальні аромати.",
    },
    imgUrl: liquidAnotherFoto2,
    conclusion1:
      "Зі звичайним нікотином вони становлять 50/50, а з сольовим часто зустрічаються 60/40. Від особливостей вашого сприйняття нікотину залежить вибір його концентрації. Якщо ви завзятий курець, то можна легко позбутися цієї згубної звички. Просто знижуйте поступово рівень вмісту нікотину у своїй рідині для електронних сигарет до повної відмови від нікотинових варіантів.",
  },

  {
    header: "Інші виробники",
    description1:
      "Також у нашому каталозі представлені рідини для вейпа від таких виробників, як Monster Vape Labs, Wick&Wire, Yummy і My Pods Salt. Ці бренди також заслуговують на увагу завдяки своїй якості та різноманітності смаків.",
    description2:
      "Купуючи рідини в нашому інтернет-магазині, ви можете бути впевнені в їхній якості та різноманітності. Ми прагнемо запропонувати вам тільки найкраще!",
  },
  {
    header: "Купити рідину для вейпа онлайн",
    description1:
      "В Україні вейпи набули широкого поширення. Мережа продавців стрімко зросла і покупці часто губляться в різноманітті чинних пропозицій. Де купити рідину для вейпа, коли достаток варіантів насторожує? Для початку зіставте ціну на різних інтернет-ресурсах. Вона має бути приблизно однаковою у тих підприємців, де продається якісна продукція. Надмірно низькі ціни повинні привести до сумніву в продавцеві. Тепер вивчіть наявність акцій та інших приємних плюшок для клієнтів. Хочете переконатися в професіоналізмі? Тоді обов'язково зателефонуйте і поставте запитання. Менеджери мають бути в темі та вміти привернути до себе клієнта. Купівля будь-яких товарів онлайн стала буденністю. Сьогодні сотні тисяч покупок відбувається саме через інтернет. Логістичні компанії також пристосувалися до нових умов на ринку і готові швидко організувати доставку в пункт призначення. Купуйте із задоволенням, бережіть здоров'я, користуйтеся якісними рідинами для електронних сигарет.",
  },
];
