import type { Product, TabaccoProduct } from "../types/product";
import type { ContentBlock } from "../types/data";

import appleBearsLightLine from "../imgs/tabaks/420/420_light_100gr_apple_bears.webp";
import orangeMangoLightLine from "../imgs/tabaks/420/420_light_100gr_apelsin_mango.webp";
import iceLemonRasberryLightLine from "../imgs/tabaks/420/420_light_100gr_ice_lemon_mint.webp";
import iceLemonMintLightLine from "../imgs/tabaks/420/420_light_100gr_ajs_limon_mjata.webp";
import berryMorse from "../imgs/tabaks/420/420_light_100gr_jagodnyj_mors.webp";
import blueberryMuffin from "../imgs/tabaks/420/420_light_100gr_chernichnyj_mafin.webp";
import skittles from "../imgs/tabaks/420/420_light_100gr_skitls.webp";
import lemonHoneyHolls from "../imgs/tabaks/420/420_light_100gr_limonno_medovyj_hols.webp";
import strawberryMilpheus from "../imgs/tabaks/420/420_light_100gr_klubnichnyj_milfej.webp";
import grapeMint from "../imgs/tabaks/420/420_light_100gr_vinograd_mjata.webp";

import arawakLogo from "../imgs/logotypes/arawak_logo.webp";
import daimLogo from "../imgs/logotypes/logo-daim.webp";
import hevenLogo from "../imgs/logotypes/heven_logo.webp";
import liraLogo from "../imgs/logotypes/lirra-logo.webp";
import pelikanLogo from "../imgs/logotypes/pelikan_logo.webp";
import tangiersLogo from "../imgs/logotypes/tangiers_logo.webp";
import WhiteSmoke from "../imgs/logotypes/whitesmok_logo.webp";
import atomLogo from "../imgs/logotypes/atom_logo.webp";
import deadHorseLogo from "../imgs/logotypes/dead_horse_logo.webp";
import indigoLogo from "../imgs/logotypes/logo_indigo.webp";
import milanoLogo from "../imgs/logotypes/milano_logo.webp";
import spaceTea from "../imgs/logotypes/space_tea_logo.webp";
import turboLogo from "../imgs/logotypes/turbo-logo.webp";
import yummyLogo from "../imgs/logotypes/yummy_logo.webp";
import fourTwentyLogo from "../imgs/logotypes/4_20_logo.webp";
import blackAndWhiteLogo from "../imgs/logotypes/black-white-logo.webp";
import flowLogo from "../imgs/logotypes/flow-logo.webp";
import jibiarLogo from "../imgs/logotypes/flow-logo.webp";
import molfarLogo from "../imgs/logotypes/logo-molfar.webp";
import spamLogo from "../imgs/logotypes/spam-logo.webp";
import unityLogo from "../imgs/logotypes/unity_logo.webp";
import cultLogo from "../imgs/logotypes/logo-cult.webp";
import absolemLogo from "../imgs/logotypes/logo_absolem.webp";
import creepyLogo from "../imgs/logotypes/creepy_logo.webp";
import gedonistLogo from "../imgs/logotypes/gedonist_logo.webp";
import lagomLogo from "../imgs/logotypes/gedonist_logo.webp";
import orwellLogo from "../imgs/logotypes/orwell_logo.webp";
import swipeLogo from "../imgs/logotypes/swipe_logo.webp";
import whiteSideLogo from "../imgs/logotypes/white_side_logo.webp";

import astiTabacco from "../imgs/tabaks/asti/tabak_asti_100gr.jpg";
import skittlesTabacco from "../imgs/tabaks/420/420_light_100gr_skitls.webp";

export const tabaccoPageBrandContent: Product[] = [
  {
    id: "0",
    name: "Arawak",
    imgUrl: arawakLogo,
  },
  {
    id: "1",
    name: "Daim",
    imgUrl: daimLogo,
  },
  {
    id: "2",
    name: "Heven",
    imgUrl: hevenLogo,
  },
  {
    id: "3",
    name: "Lirra",
    imgUrl: liraLogo,
  },
  {
    id: "4",
    name: "Pelikan",
    imgUrl: pelikanLogo,
  },
  {
    id: "5",
    name: "Tangiers",
    imgUrl: tangiersLogo,
  },
  {
    id: "6",
    name: "WhiteSmoke",
    imgUrl: WhiteSmoke,
  },
  {
    id: "7",
    name: "Atom",
    imgUrl: atomLogo,
  },
  {
    id: "8",
    name: "Dead Horse",
    imgUrl: deadHorseLogo,
  },
  {
    id: "9",
    name: "Indigo",
    imgUrl: indigoLogo,
  },
  {
    id: "10",
    name: "Milano",
    imgUrl: milanoLogo,
  },
  {
    id: "11",
    name: "Space Tea",
    imgUrl: spaceTea,
  },
  {
    id: "12",
    name: "Turbo",
    imgUrl: turboLogo,
  },
  {
    id: "13",
    name: "Yummy",
    imgUrl: yummyLogo,
  },
  {
    id: "14",
    name: "Тютюн 420 (Чотири Двадцять)",
    imgUrl: fourTwentyLogo,
  },
  {
    id: "15",
    name: "Black & White",
    imgUrl: blackAndWhiteLogo,
  },
  {
    id: "16",
    name: "Flow",
    imgUrl: flowLogo,
  },
  {
    id: "17",
    name: "Jibiar",
    imgUrl: jibiarLogo,
  },
  {
    id: "18",
    name: "Molfar",
    imgUrl: molfarLogo,
  },
  {
    id: "19",
    name: "Spam",
    imgUrl: spamLogo,
  },
  {
    id: "20",
    name: "Unity",
    imgUrl: unityLogo,
  },
  {
    id: "21",
    name: "Cult",
    imgUrl: cultLogo,
  },
  {
    id: "22",
    name: "Absolem",
    imgUrl: absolemLogo,
  },
  {
    id: "23",
    name: "Creepy",
    imgUrl: creepyLogo,
  },
  {
    id: "24",
    name: "Gedonist",
    imgUrl: gedonistLogo,
  },
  {
    id: "25",
    name: "Lagom",
    imgUrl: lagomLogo,
  },
  {
    id: "26",
    name: "Orwell",
    imgUrl: orwellLogo,
  },
  {
    id: "27",
    name: "Swipe",
    imgUrl: swipeLogo,
  },
  {
    id: "28",
    name: "White Side",
    imgUrl: whiteSideLogo,
  },
];

export const tabaccoPageContent: TabaccoProduct[] = [
  {
    id: "0",
    name: "Apple Bears (Яблучні Ведмедики)",
    imgUrl: appleBearsLightLine,
    price: 270,
    having: true,
    about: {
      country: "Україна",
      sweet: 3,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Зелене Яблуко, Мармелад",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
    },
  },

  {
    id: "1",
    name: "Orange, Mango (Апельсин, Манго)",
    imgUrl: orangeMangoLightLine,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Апельсин Манго (Апельсин Манго) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 4,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Апельсин, Манго",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
    },
  },
  {
    id: "2",
    name: "Ice, Lemon, Rasberry (Лід, Лимон, Малина)",
    imgUrl: iceLemonRasberryLightLine,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Айс Лимон Малина 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 2,
      sour: 2,
      spicy: 0,
      fresh: 2,
      taste: "Малина, Лимон, Лід",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "3",
    name: "Ice, Lemon, Mint (Лід, Лимон, Mint)",
    imgUrl: iceLemonMintLightLine,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Айс Лимон М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 0,
      sour: 3,
      spicy: 0,
      fresh: 3,
      taste: "Лимон, М'ята, Лід",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",
      recomendedCup: "Глина",
    },
  },
  {
    id: "4",

    name: "Berry Morse (Ягідний Морс)",

    imgUrl: berryMorse,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Ягідний Морс 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Ожина, Журавлина, Смородина, Малина",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "5",

    name: "Blueberry Muffin (Чорничний Мафін)",

    imgUrl: blueberryMuffin,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Чорничний Мафін 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 4,
      sour: 0,
      spicy: 2,
      fresh: 0,
      taste: "Чорниця, Маффін",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "6",

    name: "Skittles (Скіттлс)",

    imgUrl: skittles,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Скіттлс (Скіттлс) 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 2,
      spicy: 0,
      fresh: 0,
      taste: "Скіттлс",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "7",

    name: "Lemon-Honey Holls (Лимонно-Медовий Холлс)",

    imgUrl: lemonHoneyHolls,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Лимонно-Медовий Холлс 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 2,
      sour: 2,
      spicy: 0,
      fresh: 2,
      taste: "Лимон, Мед, Холлс",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "8",

    name: "Strawberry Milpheus (Полуничний Мільфей)",

    imgUrl: strawberryMilpheus,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Полуничний Мільфей 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 4,
      sour: 0,
      spicy: 1,
      fresh: 0,
      taste: "Полуниця, Пиріг, Вершки",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "9",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "10",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "11",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "12",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "13",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "14",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "15",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "16",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "17",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "18",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "19",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "20",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "21",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "22",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "23",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "24",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "25",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "26",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "27",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "28",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "29",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "30",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "31",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "32",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "33",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "34",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "35",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "36",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "37",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "38",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "39",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "40",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "41",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "42",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "43",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "44",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
  {
    id: "45",

    name: "Grape Mint (Виноградна М'ята)",

    imgUrl: grapeMint,
    price: 270,
    having: true,
    description:
      "420 - це ароматна тютюнова суміш, яка здатна перевернути ваші смакові рецептори з ніг на голову. Продукт вирізняється середньою міцністю. Для її посилення набивка має бути щільнішою, для більшої легкості - розпушена перед курінням. Під час використання тютюн дає густий, ароматний дим. Тютюн 420(Чотири Двадцять) Light Line Виноградна М'ята 100гр має безпечний склад. Начинку виготовляють із листя добірних сортів тютюну, яке перед приготуванням ретельно очищають, а потім заправляють великою кількістю солодкого сиропу.",
    about: {
      country: "Україна",
      sweet: 3,
      sour: 0,
      spicy: 0,
      fresh: 3,
      taste: "Чорний Виноград, М'ята",
      tough: "Легкий",
      smokiness: "Висока",
      fireResistance: "Висока",

      recomendedCup: "Глина",
    },
  },
];


